tylertms/dspic33e-sim/src/firmware_runner.c
#include "firmware_runner.h"

#include <inttypes.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#ifdef _WIN32
#include <windows.h>
#endif

#include "dspic33.h"
#include "firmware_image.h"
#include "json.h"
#include "scenario_stream.h"

enum {
    MAX_STEP_PARTS = 32,
    MAX_MATRIX_DIMENSIONS = 16,
    MAX_MAPPED_FIELDS = 64,
    MAX_MAPPED_TARGETS = 32
};

typedef struct RunTask RunTask;

typedef struct {
    const JsonValue* suite;
    const char* suite_path;
    const char* program_path;
    const char* reference_path;
    const char* candidate_path;
    char suite_directory[1024];
    const char* scenario_filter;
    const char* step_filter;
    size_t shard_index;
    size_t shard_count;
    bool plan_only;
    bool summary_only;
    bool failures_only;
    size_t scenarios;
    size_t steps;
    size_t current_scenario;
    size_t current_step;
    size_t passed;
    size_t failed;
    size_t comparisons;
    size_t failed_comparisons;
    uint64_t reference_instructions;
    uint64_t candidate_instructions;
    uint64_t reference_cycles;
    uint64_t candidate_cycles;
    uint64_t instruction_limit;
    const char* ledger_path;
    const char* summary_path;
    char ledger_partial_path[1024];
    FILE* ledger;
    const char* current_scenario_identifier;
    const char* current_scenario_source;
    const char* current_step_identifier;
    FirmwareImage reference_image;
    FirmwareImage candidate_image;
    Dspic33 reference;
    Dspic33 candidate;
    Dspic33 reference_pristine;
    Dspic33 candidate_pristine;
    Dspic33 reference_baseline;
    Dspic33 candidate_baseline;
    bool restore_baseline;
#ifdef _WIN32
    RunTask* run_tasks;
#endif
} Runner;

static const uint64_t DEFAULT_INSTRUCTION_LIMIT = 1000000u;

static void write_json_string(FILE* stream, const char* value) {
    const unsigned char* current = (const unsigned char*)(value == NULL ? "" : value);
    fputc('"', stream);
    while (*current != '\0') {
        if (*current == '"' || *current == '\\') {
            fputc('\\', stream);
            fputc(*current, stream);
        } else if (*current == '\n') {
            fputs("\\n", stream);
        } else if (*current == '\r') {
            fputs("\\r", stream);
        } else if (*current == '\t') {
            fputs("\\t", stream);
        } else if (*current < 0x20u) {
            fprintf(stream, "\\u%04x", *current);
        } else {
            fputc(*current, stream);
        }
        current++;
    }
    fputc('"', stream);
}

static void write_json_path(FILE* stream, const char* value) {
    const unsigned char* current = (const unsigned char*)(value == NULL ? "" : value);
    fputc('"', stream);
    while (*current != '\0') {
        if (*current == '\\') {
            fputc('/', stream);
        } else if (*current == '"') {
            fputs("\\\"", stream);
        } else if (*current == '\n') {
            fputs("\\n", stream);
        } else if (*current == '\r') {
            fputs("\\r", stream);
        } else if (*current == '\t') {
            fputs("\\t", stream);
        } else if (*current < 0x20u) {
            fprintf(stream, "\\u%04x", *current);
        } else {
            fputc(*current, stream);
        }
        current++;
    }
    fputc('"', stream);
}

static void record_comparison(Runner* runner, const char* category, const char* name,
                              const char* evidence_class, bool matched) {
    runner->comparisons++;
    runner->failed_comparisons += matched ? 0u : 1u;
    if (runner->ledger == NULL) {
        return;
    }
    fputs("{\"comparison\":{\"category\":", runner->ledger);
    write_json_string(runner->ledger, category);
    fputs(",\"evidence_class\":", runner->ledger);
    write_json_string(runner->ledger, evidence_class);
    fprintf(runner->ledger, ",\"matched\":%s,\"name\":", matched ? "true" : "false");
    write_json_string(runner->ledger, name);
    fprintf(runner->ledger,
            "},\"comparison_index\":%zu,\"evidence_class\":", runner->comparisons);
    write_json_string(runner->ledger, evidence_class);
    fprintf(runner->ledger,
            ",\"outcome\":\"%s\",\"runner\":\"native\",\"scenario_id\":",
            matched ? "pass" : "fail");
    write_json_string(runner->ledger, runner->current_scenario_identifier);
    fprintf(runner->ledger,
            ",\"shard_count\":%zu,\"shard_index\":%zu,\"source\":", runner->shard_count,
            runner->shard_index);
    write_json_path(runner->ledger, runner->current_scenario_source);
    fputs(",\"step_id\":", runner->ledger);
    write_json_string(runner->ledger, runner->current_step_identifier);
    fprintf(runner->ledger, ",\"step_index\":%zu}\n", runner->current_step);
    fflush(runner->ledger);
}

static bool open_comparison_ledger(Runner* runner, char* error, size_t error_size) {
    int written;
    if (runner->ledger_path == NULL) {
        return true;
    }
    written = snprintf(runner->ledger_partial_path, sizeof(runner->ledger_partial_path),
                       "%s.partial", runner->ledger_path);
    if (written < 0 || (size_t)written >= sizeof(runner->ledger_partial_path)) {
        snprintf(error, error_size, "comparison ledger path is too long");
        return false;
    }
    runner->ledger = fopen(runner->ledger_partial_path, "wb");
    if (runner->ledger == NULL) {
        snprintf(error, error_size, "cannot open comparison ledger");
        return false;
    }
    return true;
}

static bool close_comparison_ledger(Runner* runner, bool complete, char* error,
                                    size_t error_size) {
    if (runner->ledger == NULL) {
        return true;
    }
    if (fclose(runner->ledger) != 0) {
        runner->ledger = NULL;
        snprintf(error, error_size, "cannot close comparison ledger");
        return false;
    }
    runner->ledger = NULL;
    if (!complete || runner->ledger_path == NULL) {
        return true;
    }
    remove(runner->ledger_path);
    if (rename(runner->ledger_partial_path, runner->ledger_path) != 0) {
        snprintf(error, error_size, "cannot finalize comparison ledger");
        return false;
    }
    return true;
}

static bool write_summary_json(const Runner* runner, char* error, size_t error_size) {
    FILE* stream;
    char partial_path[1024];
    int written;
    if (runner->summary_path == NULL) {
        return true;
    }
    written = snprintf(partial_path, sizeof(partial_path), "%s.partial",
                       runner->summary_path);
    if (written < 0 || (size_t)written >= sizeof(partial_path)) {
        snprintf(error, error_size, "native summary path is too long");
        return false;
    }
    stream = fopen(partial_path, "wb");
    if (stream == NULL) {
        snprintf(error, error_size, "cannot open native summary");
        return false;
    }
    fputs("{\"candidate_cycles\":", stream);
    fprintf(stream, "%" PRIu64 ",\"candidate_instructions\":%" PRIu64,
            runner->candidate_cycles, runner->candidate_instructions);
    fprintf(stream, ",\"comparisons\":%zu,\"failed_comparisons\":%zu",
            runner->comparisons, runner->failed_comparisons);
    fputs(",\"candidate_image\":", stream);
    write_json_path(stream, runner->candidate_path);
    fprintf(stream, ",\"failed_steps\":%zu,\"ledger\":", runner->failed);
    if (runner->ledger_path == NULL) {
        fputs("null", stream);
    } else {
        write_json_path(stream, runner->ledger_path);
    }
    fprintf(stream, ",\"max_instructions\":%" PRIu64 ",\"passed_steps\":%zu",
            runner->instruction_limit, runner->passed);
    fprintf(stream,
            ",\"reference_cycles\":%" PRIu64 ",\"reference_instructions\":%" PRIu64,
            runner->reference_cycles, runner->reference_instructions);
    fputs(",\"reference_image\":", stream);
    write_json_path(stream, runner->reference_path);
    fputs(",\"runner\":\"native\",\"scenario_filter\":", stream);
    if (runner->scenario_filter == NULL) {
        fputs("null", stream);
    } else {
        write_json_string(stream, runner->scenario_filter);
    }
    fprintf(stream, ",\"scenarios\":%zu,\"schema_version\":1",
            runner->current_scenario);
    fprintf(stream, ",\"selected_scenarios\":%zu,\"selected_steps\":%zu",
            runner->scenarios, runner->steps);
    fputs(",\"simulator\":", stream);
    write_json_path(stream, runner->program_path);
    fprintf(stream, ",\"shard_count\":%zu,\"shard_index\":%zu", runner->shard_count,
            runner->shard_index);
    fputs(",\"step_filter\":", stream);
    if (runner->step_filter == NULL) {
        fputs("null", stream);
    } else {
        write_json_string(stream, runner->step_filter);
    }
    fprintf(stream, ",\"steps\":%zu,\"suite\":", runner->current_step);
    write_json_path(stream, runner->suite_path);
    fputs("}\n", stream);
    if (fclose(stream) != 0) {
        snprintf(error, error_size, "cannot close native summary");
        return false;
    }
    remove(runner->summary_path);
    if (rename(partial_path, runner->summary_path) != 0) {
        snprintf(error, error_size, "cannot finalize native summary");
        return false;
    }
    return true;
}

