tylertms/dspic33e-sim/src/firmware_runner.c
static size_t values_count(const Runner* runner, const JsonValue* specification) {
    const char* set_name = json_string(json_get(specification, "values"));
    const JsonValue* values;
    int64_t start;
    int64_t end;
    int64_t stride = 1;
    if (set_name != NULL) {
        values = named_entry(suite_section(runner, "value_sets"), set_name);
        return values != NULL && values->type == JSON_ARRAY ? values->as.array.count
                                                            : 0u;
    }
    if (!parse_number(json_get(specification, "start"), &start) ||
        !parse_number(json_get(specification, "end"), &end)) {
        return 0u;
    }
    if (json_get(specification, "stride") != NULL &&
        !parse_number(json_get(specification, "stride"), &stride)) {
        return 0u;
    }
    return stride > 0 && end >= start ? (size_t)((end - start) / stride + 1) : 0u;
}

static size_t matrix_dimension_count(const Runner* runner, const JsonValue* dimension) {
    const JsonValue* rows;
    if (dimension->type == JSON_ARRAY) {
        return dimension->as.array.count;
    }
    rows = json_get(dimension, "rows");
    if (rows != NULL) {
        return rows->type == JSON_ARRAY ? rows->as.array.count : 0u;
    }
    return values_count(runner, dimension);
}

static size_t matrix_count(const Runner* runner, const JsonValue* matrix) {
    const JsonValue* dimensions = json_get(matrix, "dimensions");
    const char* strategy = json_string(json_get(matrix, "strategy"));
    size_t counts[MAX_MATRIX_DIMENSIONS];
    size_t index;
    size_t result = 1u;
    if (dimensions == NULL || dimensions->type != JSON_ARRAY ||
        dimensions->as.array.count > MAX_MATRIX_DIMENSIONS) {
        return 0u;
    }
    for (index = 0u; index < dimensions->as.array.count; index++) {
        const JsonValue* dimension = dimensions->as.array.items[index];
        counts[index] = matrix_dimension_count(runner, dimension);
        if (counts[index] == 0u) {
            return 0u;
        }
    }
    if (strategy == NULL || strcmp(strategy, "product") == 0) {
        for (index = 0u; index < dimensions->as.array.count; index++) {
            result *= counts[index];
        }
        return result;
    }
    if (strcmp(strategy, "pairwise") == 0) {
        size_t left;
        result = 1u;
        for (index = 0u; index < dimensions->as.array.count; index++) {
            result += counts[index] - 1u;
        }
        for (left = 0u; left < dimensions->as.array.count; left++) {
            for (index = left + 1u; index < dimensions->as.array.count; index++) {
                result += (counts[left] - 1u) * (counts[index] - 1u);
            }
        }
        return result;
    }
    return true;
}

static size_t scenario_step_count(const Runner* runner, const JsonValue* scenario) {
    const JsonValue* fixtures = json_get(scenario, "fixtures");
    const JsonValue* mode;
    const char* scenario_name = json_string(json_get(scenario, "name"));
    size_t count = 0u;
    size_t index;
    if (fixtures != NULL && fixtures->type == JSON_ARRAY) {
        for (index = 0u; index < fixtures->as.array.count; index++) {
            const char* name = json_string(fixtures->as.array.items[index]);
            if (name != NULL) {
                count += fixture_step_count(runner, name, 0u);
            }
        }
    }
    mode = json_get(scenario, "steps");
    if (mode == NULL) {
        mode = json_get(scenario, "vectors");
    }
    if (mode != NULL && mode->type == JSON_ARRAY) {
        size_t selected = 0u;
        for (index = 0u; index < mode->as.array.count; index++) {
            if (step_selected(runner, mode->as.array.items[index])) {
                selected++;
            }
        }
        return selected == 0u ? 0u : count + selected;
    }
    mode = json_get(scenario, "range");
    if (mode != NULL) {
        return runner->step_filter == NULL ? count + values_count(runner, mode) : 0u;
    }
    mode = json_get(scenario, "matrix");
    if (mode != NULL) {
        size_t selected = generated_step_count(runner, scenario_name, "matrix case",
                                               matrix_count(runner, mode));
        return selected == 0u ? 0u : count + selected;
    }
    return count;
}

static bool count_scenario(const char* path, const JsonValue* scenario, void* context,
                           char* error, size_t error_size) {
    Runner* runner = context;
    size_t count;
    (void)path;
    if (!scenario_selected(runner, scenario)) {
        return true;
    }
    count = scenario_step_count(runner, scenario);
    if (count == 0u && runner->step_filter != NULL) {
        return true;
    }
    if (count == 0u) {
        snprintf(error, error_size, "scenario has no executable steps: %s",
                 json_string(json_get(scenario, "id")));
        return false;
    }
    runner->scenarios++;
    runner->steps += count;
    return true;
}

static bool build_pattern(const Runner* runner, const char* relative, char* path,
                          size_t size) {
    int length;
    if (relative[0] == '/' || relative[0] == '\\' ||
        (strlen(relative) > 2u && relative[1] == ':')) {
        length = snprintf(path, size, "%s", relative);
    } else {
        length = snprintf(path, size, "%s\\%s", runner->suite_directory, relative);
    }
    return length >= 0 && (size_t)length < size;
}

static bool stream_patterns(Runner* runner, ScenarioVisitor visitor, char* error,
                            size_t error_size) {
    const JsonValue* patterns = suite_section(runner, "scenario_files");
    size_t index;
    if (patterns == NULL || patterns->type != JSON_ARRAY) {
        snprintf(error, error_size, "suite has no scenario_files array");
        return false;
    }
    for (index = 0u; index < patterns->as.array.count; index++) {
        const char* relative = json_string(patterns->as.array.items[index]);
        char pattern[2048];
        if (relative == NULL ||
            !build_pattern(runner, relative, pattern, sizeof(pattern)) ||
            !scenario_stream(pattern, visitor, runner, error, error_size)) {
            return false;
        }
    }
    return true;
}

static bool suite_directory(const char* path, char* directory, size_t size) {
    const char* slash = strrchr(path, '\\');
    const char* forward = strrchr(path, '/');
    size_t length;
    if (forward != NULL && (slash == NULL || forward > slash)) {
        slash = forward;
    }
    if (slash == NULL) {
        return snprintf(directory, size, ".") > 0;
    }
    length = (size_t)(slash - path);
    if (length + 1u > size) {
        return false;
    }
    memcpy(directory, path, length);
    directory[length] = '\0';
    return true;
}

static bool open_images(Runner* runner, char* error, size_t error_size) {
    const char* reference_path = runner->reference_path;
    const char* candidate_path = runner->candidate_path;
    if (reference_path == NULL) {
        reference_path =
            json_string(json_get(suite_section(runner, "reference"), "path"));
    }
    if (candidate_path == NULL) {
        candidate_path =
            json_string(json_get(suite_section(runner, "candidate"), "path"));
    }
    if (reference_path == NULL || candidate_path == NULL) {
        snprintf(error, error_size, "suite image paths are invalid");
        return false;
    }
    runner->reference_path = reference_path;
    runner->candidate_path = candidate_path;
    printf("[prepare] Loading reference image\n");
    fflush(stdout);
    if (!firmware_image_open(&runner->reference_image, reference_path, error,
                             error_size)) {
        return false;
    }
    printf("[prepare] Loading candidate image\n");
    fflush(stdout);
    if (!firmware_image_open(&runner->candidate_image, candidate_path, error,
                             error_size)) {
        firmware_image_close(&runner->reference_image);
        return false;
    }
    if (!dspic33_initialize(&runner->reference) ||
        !dspic33_initialize(&runner->candidate) ||
        !dspic33_initialize(&runner->reference_pristine) ||
        !dspic33_initialize(&runner->candidate_pristine) ||
        !dspic33_initialize(&runner->reference_baseline) ||
        !dspic33_initialize(&runner->candidate_baseline) ||
        !firmware_image_load_program(&runner->reference_image, &runner->reference,
                                     error, error_size) ||
        !firmware_image_load_program(&runner->candidate_image, &runner->candidate,
                                     error, error_size)) {
        return false;
    }
    runner->reference.stop_on_trap = true;
    runner->candidate.stop_on_trap = true;
    reset_pair(runner);
    return save_pristine_pair(runner, error, error_size);
}

static void close_images(Runner* runner) {
    dspic33_destroy(&runner->reference);
    dspic33_destroy(&runner->candidate);
    dspic33_destroy(&runner->reference_pristine);
    dspic33_destroy(&runner->candidate_pristine);
    dspic33_destroy(&runner->reference_baseline);
    dspic33_destroy(&runner->candidate_baseline);
    firmware_image_close(&runner->reference_image);
    firmware_image_close(&runner->candidate_image);
}

static bool register_index(const char* name, uint8_t* result) {
    char* end;
    long value;
    if (name == NULL || name[0] != 'W') {
        return false;
    }
    value = strtol(name + 1, &end, 10);
    if (*end != '\0' || value < 0 || value > 15) {
        return false;
    }
    *result = (uint8_t)value;
    return true;
}

static bool pin_index(const char* name, uint8_t* port, uint8_t* bit) {
    char* end;
    long value;
    if (name == NULL || name[0] != 'R' || name[1] < 'A' || name[1] > 'G') {
        return false;
    }
    value = strtol(name + 2, &end, 10);
    if (*end != '\0' || value < 0 || value > 15) {
        return false;
    }
    *port = (uint8_t)(name[1] - 'A');
    *bit = (uint8_t)value;
    return true;
}

static bool field_number(const Runner* runner, const JsonValue* specification,
                         const char* name, int64_t default_value, int64_t* result) {
    const JsonValue* value = entry_field(runner, specification, name);
    if (value == NULL) {
        *result = default_value;
        return true;
    }
    return parse_number(value, result);
}

static uint8_t read_memory_byte(Dspic33* cpu, const char* space, uint32_t address) {
    if (space != NULL && strcmp(space, "program") == 0) {
        return dspic33_read_program_byte(cpu, address);
    }
    if (space != NULL && strcmp(space, "configuration") == 0) {
        return dspic33_read_configuration_byte(cpu, address);
    }
    return dspic33_read_byte(cpu, address);
}

