tylertms/dspic33e-sim/src/firmware_runner.c
static bool event_number(const JsonValue* specification, const char* name,
                         uint64_t maximum, uint64_t default_value, bool required,
                         uint64_t* result) {
    const JsonValue* value = json_get(specification, name);
    int64_t parsed;
    if (value == NULL) {
        if (required) {
            return false;
        }
        *result = default_value;
        return true;
    }
    if (!parse_number(value, &parsed) || parsed < 0 || (uint64_t)parsed > maximum) {
        return false;
    }
    *result = (uint64_t)parsed;
    return true;
}

static bool byte_array(const JsonValue* value, uint8_t* bytes, size_t capacity,
                       uint16_t* size) {
    size_t index;
    if (value == NULL || value->type != JSON_ARRAY ||
        value->as.array.count > capacity) {
        return false;
    }
    for (index = 0u; index < value->as.array.count; index++) {
        int64_t byte;
        if (!parse_number(value->as.array.items[index], &byte) || byte < 0 ||
            byte > UINT8_MAX) {
            return false;
        }
        bytes[index] = (uint8_t)byte;
    }
    *size = (uint16_t)value->as.array.count;
    return true;
}

static bool usb_handshake_value(const char* name, Dspic33UsbHandshake* handshake) {
    static const char* names[] = {"none", "ack", "nak", "stall", "timeout", "error"};
    size_t index;
    if (name == NULL) {
        return false;
    }
    for (index = 1u; index < sizeof(names) / sizeof(names[0]); index++) {
        if (strcmp(name, names[index]) == 0) {
            *handshake = (Dspic33UsbHandshake)index;
            return true;
        }
    }
    return false;
}

static bool usb_bus_event_value(const char* name, Dspic33UsbBusEvent* event) {
    static const char* names[] = {"reset",  "sof",    "idle",  "resume",
                                  "attach", "detach", "error", "otg_state"};
    size_t index;
    if (name == NULL) {
        return false;
    }
    for (index = 0u; index < sizeof(names) / sizeof(names[0]); index++) {
        if (strcmp(name, names[index]) == 0) {
            *event = (Dspic33UsbBusEvent)index;
            return true;
        }
    }
    return false;
}

static bool apply_device_stimulus(Dspic33* cpu, const char* type,
                                  const JsonValue* specification, char* error,
                                  size_t error_size) {
    uint64_t channel = 0u;
    uint64_t value = 0u;
    uint64_t delay = 0u;
    bool succeeded = false;
    if (!event_number(specification, "delay", UINT64_MAX, 0u, false, &delay)) {
        snprintf(error, error_size, "invalid %s stimulus delay", type);
        return false;
    }
    if (strcmp(type, "interrupts") == 0) {
        succeeded = event_number(specification, "irq", DSPIC33_IRQ_COUNT - 1u, 0u, true,
                                 &channel) &&
                    dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, (uint16_t)channel,
                                     0u, delay);
    } else if (strcmp(type, "dma_requests") == 0) {
        succeeded =
            event_number(specification, "request", UINT8_MAX, 0u, true, &channel) &&
            event_number(specification, "indirect_address", UINT16_MAX, 0u, false,
                         &value) &&
            dspic33_dma_request(cpu, (uint8_t)channel, (uint16_t)value, delay);
    } else if (strcmp(type, "timer_pulses") == 0) {
        succeeded =
            event_number(specification, "timer", DSPIC33_TIMER_COUNT, 0u, true,
                         &channel) &&
            channel != 0u &&
            event_number(specification, "pulses", UINT32_MAX, 0u, true, &value) &&
            value != 0u &&
            dspic33_timer_pulse(cpu, (uint8_t)(channel - 1u), (uint32_t)value, delay);
    } else if (strcmp(type, "timer_gates") == 0) {
        const JsonValue* high_value = json_get(specification, "high");
        bool high = false;
        succeeded = event_number(specification, "timer", DSPIC33_TIMER_COUNT, 0u, true,
                                 &channel) &&
                    channel != 0u && high_value != NULL &&
                    json_boolean(high_value, &high) &&
                    dspic33_timer_gate(cpu, (uint8_t)(channel - 1u), high, delay);
    } else if (strcmp(type, "uart_rx") == 0) {
        const JsonValue* parity_error_value = json_get(specification, "parity_error");
        const JsonValue* framing_error_value = json_get(specification, "framing_error");
        Dspic33UartFrame frame;
        uint64_t baud_period = 0u;
        memset(&frame, 0, sizeof(frame));
        succeeded = event_number(specification, "channel", DSPIC33_UART_COUNT - 1u, 0u,
                                 true, &channel) &&
                    event_number(specification, "value", 0x01ffu, 0u, true, &value) &&
                    event_number(specification, "baud_period", UINT16_MAX, 0u, false,
                                 &baud_period) &&
                    (parity_error_value == NULL ||
                     json_boolean(parity_error_value, &frame.parity_error)) &&
                    (framing_error_value == NULL ||
                     json_boolean(framing_error_value, &frame.framing_error));
        frame.value = (uint16_t)value;
        frame.baud_period = (uint16_t)baud_period;
        succeeded = succeeded &&
                    dspic33_uart_receive_frame(cpu, (uint8_t)channel, &frame, delay);
    } else if (strcmp(type, "uart_cts") == 0) {
        const JsonValue* clear_value = json_get(specification, "clear_to_send");
        bool clear_to_send = false;
        succeeded = event_number(specification, "channel", DSPIC33_UART_COUNT - 1u, 0u,
                                 true, &channel) &&
                    clear_value != NULL && json_boolean(clear_value, &clear_to_send) &&
                    dspic33_uart_set_cts(cpu, (uint8_t)channel, clear_to_send, delay);
    } else if (strcmp(type, "spi_rx") == 0) {
        succeeded =
            event_number(specification, "channel", DSPIC33_SPI_COUNT - 1u, 0u, true,
                         &channel) &&
            event_number(specification, "value", UINT16_MAX, 0u, true, &value) &&
            dspic33_spi_receive(cpu, (uint8_t)channel, (uint16_t)value, delay);
    } else if (strcmp(type, "spi_select") == 0) {
        const JsonValue* selected_value = json_get(specification, "selected");
        bool selected = false;
        succeeded = event_number(specification, "channel", DSPIC33_SPI_COUNT - 1u, 0u,
                                 true, &channel) &&
                    selected_value != NULL && json_boolean(selected_value, &selected) &&
                    dspic33_spi_select(cpu, (uint8_t)channel, selected, delay);
    } else if (strcmp(type, "adc") == 0) {
        succeeded = event_number(specification, "channel",
                                 DSPIC33_ADC_CHANNEL_COUNT - 1u, 0u, true, &channel) &&
                    event_number(specification, "value", 0x0fffu, 0u, true, &value);
        if (succeeded) {
            dspic33_adc_input(cpu, (uint8_t)channel, (uint16_t)value);
        }
    } else if (strcmp(type, "adc_triggers") == 0) {
        succeeded =
            event_number(specification, "module", DSPIC33_ADC_COUNT, 0u, true,
                         &channel) &&
            channel != 0u &&
            event_number(specification, "source", 14u, 0u, true, &value) &&
            dspic33_adc_trigger(cpu, (uint8_t)(channel - 1u), (uint8_t)value, delay);
    } else if (strcmp(type, "pwm_faults") == 0 ||
               strcmp(type, "pwm_current_limits") == 0) {
        const JsonValue* high_value = json_get(specification, "high");
        bool high = false;
        succeeded =
            event_number(specification, "source", DSPIC33_PWM_INPUT_COUNT - 1u, 0u,
                         true, &channel) &&
            high_value != NULL && json_boolean(high_value, &high) &&
            (strcmp(type, "pwm_faults") == 0
                 ? dspic33_pwm_fault(cpu, (uint8_t)channel, high, delay)
                 : dspic33_pwm_current_limit(cpu, (uint8_t)channel, high, delay));
    } else if (strcmp(type, "pwm_sync") == 0) {
        const JsonValue* high_value = json_get(specification, "high");
        bool high = false;
        succeeded = event_number(specification, "input", 2u, 0u, true, &channel) &&
                    channel != 0u && high_value != NULL &&
                    json_boolean(high_value, &high) &&
                    dspic33_pwm_sync(cpu, (uint8_t)(channel - 1u), high, delay);
    } else if (strcmp(type, "pwm_dead_time") == 0) {
        const JsonValue* high_value = json_get(specification, "high");
        bool high = false;
        succeeded = event_number(specification, "generator", DSPIC33_PWM_COUNT, 0u,
                                 true, &channel) &&
                    channel != 0u && high_value != NULL &&
                    json_boolean(high_value, &high) &&
                    dspic33_pwm_dead_time(cpu, (uint8_t)(channel - 1u), high, delay);
    } else if (strcmp(type, "can_errors") == 0) {
        const JsonValue* transmit_value = json_get(specification, "transmit");
        bool transmit = false;
        succeeded =
            event_number(specification, "channel", DSPIC33_CAN_COUNT - 1u, 0u, true,
                         &channel) &&
            event_number(specification, "count", UINT8_MAX, 0u, true, &value) &&
            value != 0u && transmit_value != NULL &&
            json_boolean(transmit_value, &transmit) &&
            dspic33_can_error(cpu, (uint8_t)channel, transmit, (uint8_t)value, delay);
    } else if (strcmp(type, "can_rx") == 0) {
        const JsonValue* data = json_get(specification, "data");
        const JsonValue* extended_value = json_get(specification, "extended");
        const JsonValue* remote_value = json_get(specification, "remote");
        Dspic33CanFrame frame;
        size_t index;
        memset(&frame, 0, sizeof(frame));
        succeeded =
            event_number(specification, "channel", DSPIC33_CAN_COUNT - 1u, 0u, true,
                         &channel) &&
            event_number(specification, "identifier", 0x1fffffffu, 0u, true, &value) &&
            data != NULL && data->type == JSON_ARRAY &&
            data->as.array.count <= sizeof(frame.data);
        frame.identifier = (uint32_t)value;
        frame.length = succeeded ? (uint8_t)data->as.array.count : 0u;
        if (extended_value != NULL && !json_boolean(extended_value, &frame.extended)) {
            succeeded = false;
        }
        if (remote_value != NULL && !json_boolean(remote_value, &frame.remote)) {
            succeeded = false;
        }
        for (index = 0u; succeeded && index < frame.length; index++) {
            int64_t byte;
            succeeded = parse_number(data->as.array.items[index], &byte) && byte >= 0 &&
                        byte <= UINT8_MAX;
            frame.data[index] = (uint8_t)byte;
        }
        succeeded =
            succeeded && dspic33_can_receive(cpu, (uint8_t)channel, &frame, delay);
    } else if (strcmp(type, "usb_rx") == 0 || strcmp(type, "usb_setup") == 0) {
        const JsonValue* data = json_get(specification, "data");
        const JsonValue* data1_value = json_get(specification, "data1");
        const JsonValue* address_value = json_get(specification, "address");
        uint8_t bytes[DSPIC33_USB_PACKET_SIZE];
        uint16_t size = 0u;
        bool data1 = false;
        succeeded = event_number(specification, "endpoint", 15u, 0u, true, &channel) &&
                    byte_array(data, bytes, sizeof(bytes), &size) &&
                    (data1_value == NULL || json_boolean(data1_value, &data1)) &&
                    (address_value == NULL ||
                     event_number(specification, "address", 0x7fu, 0u, true, &value));
        if (succeeded) {
            uint8_t pid = strcmp(type, "usb_setup") == 0 ? DSPIC33_USB_PID_SETUP
                                                         : DSPIC33_USB_PID_OUT;
            succeeded =
                address_value != NULL
                    ? dspic33_usb_token(cpu, (uint8_t)value, (uint8_t)channel,
                                        (Dspic33UsbPid)pid, bytes, size, data1, delay)
                    : (pid == DSPIC33_USB_PID_SETUP
                           ? dspic33_usb_setup(cpu, (uint8_t)channel, bytes, size,
                                               delay)
                           : dspic33_usb_receive_toggle(cpu, (uint8_t)channel, bytes,
                                                        size, data1, delay));
        }
    } else if (strcmp(type, "usb_in") == 0) {
        const JsonValue* address_value = json_get(specification, "address");
        succeeded = event_number(specification, "endpoint", 15u, 0u, true, &channel) &&
                    (address_value == NULL ||
                     event_number(specification, "address", 0x7fu, 0u, true, &value)) &&
                    (address_value != NULL
                         ? dspic33_usb_token(cpu, (uint8_t)value, (uint8_t)channel,
                                             DSPIC33_USB_PID_IN, NULL, 0u, false, delay)
                         : dspic33_usb_request(cpu, (uint8_t)channel, delay));
    } else if (strcmp(type, "usb_host_responses") == 0) {
        const JsonValue* data = json_get(specification, "data");
        const JsonValue* data1_value = json_get(specification, "data1");
        Dspic33UsbHandshake handshake;
        uint8_t bytes[DSPIC33_USB_PACKET_SIZE];
        uint16_t size = 0u;
        bool data1 = false;
        succeeded =
            usb_handshake_value(json_string(json_get(specification, "handshake")),
                                &handshake) &&
            (data == NULL || byte_array(data, bytes, sizeof(bytes), &size)) &&
            (data1_value == NULL || json_boolean(data1_value, &data1)) &&
            dspic33_usb_host_response(cpu, handshake, bytes, size, data1, delay);
    } else if (strcmp(type, "usb_bus") == 0) {
        Dspic33UsbBusEvent event;
        succeeded = usb_bus_event_value(json_string(json_get(specification, "event")),
                                        &event) &&
                    event_number(specification, "value", UINT16_MAX,
                                 event == DSPIC33_USB_BUS_SOF ? UINT16_MAX : 0u, false,
                                 &value) &&
                    dspic33_usb_bus(cpu, event, (uint16_t)value, delay);
    }
    if (!succeeded) {
        snprintf(error, error_size, "invalid %s stimulus", type);
    }
    return succeeded;
}

static bool apply_device_stimuli_pair(Runner* runner, const JsonValue* stimuli,
                                      const char* type, char* error,
                                      size_t error_size) {
    const JsonValue* values = json_get(stimuli, type);
    size_t index;
    if (values == NULL) {
        return true;
    }
    if (values->type != JSON_ARRAY) {
        snprintf(error, error_size, "%s stimuli must be an array", type);
        return false;
    }
    for (index = 0u; index < values->as.array.count; index++) {
        if (!apply_device_stimulus(&runner->reference, type,
                                   values->as.array.items[index], error, error_size) ||
            !apply_device_stimulus(&runner->candidate, type,
                                   values->as.array.items[index], error, error_size)) {
            return false;
        }
    }
    return true;
}

static bool apply_stimuli_part(Runner* runner, const JsonValue* part, char* error,
                               size_t error_size) {
    const JsonValue* stimuli = json_get(part, "stimuli");
    const JsonValue* values;
    size_t index;
    if (stimuli == NULL) {
        return true;
    }
    values = json_get(stimuli, "memory");
    if (values != NULL && values->type == JSON_ARRAY) {
        for (index = 0u; index < values->as.array.count; index++) {
            if (!write_memory_value(
                    runner, &runner->reference, &runner->reference_image,
                    values->as.array.items[index], false, error, error_size) ||
                !write_memory_value(
                    runner, &runner->candidate, &runner->candidate_image,
                    values->as.array.items[index], true, error, error_size)) {
                return false;
            }
        }
    }
    values = json_get(stimuli, "registers");
    if (values != NULL && values->type == JSON_ARRAY) {
        for (index = 0u; index < values->as.array.count; index++) {
            if (!apply_register(runner, &runner->reference, &runner->reference_image,
                                values->as.array.items[index], false, error,
                                error_size) ||
                !apply_register(runner, &runner->candidate, &runner->candidate_image,
                                values->as.array.items[index], true, error,
                                error_size)) {
                return false;
            }
        }
    }
    values = json_get(stimuli, "pins");
    if (values != NULL && values->type == JSON_ARRAY) {
        for (index = 0u; index < values->as.array.count; index++) {
            if (!apply_pin(&runner->reference, values->as.array.items[index], error,
                           error_size) ||
                !apply_pin(&runner->candidate, values->as.array.items[index], error,
                           error_size)) {
                return false;
            }
        }
    }
    return apply_device_stimuli_pair(runner, stimuli, "interrupts", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "dma_requests", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "timer_pulses", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "timer_gates", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "uart_cts", error, error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "uart_rx", error, error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "spi_select", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "spi_rx", error, error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "adc", error, error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "adc_triggers", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "pwm_faults", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "pwm_current_limits", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "pwm_dead_time", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "pwm_sync", error, error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "can_errors", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "can_rx", error, error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "usb_rx", error, error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "usb_setup", error, error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "usb_in", error, error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "usb_host_responses", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "usb_bus", error, error_size);
}

static bool part_has_async_stimuli(const JsonValue* part) {
    static const char* const names[] = {
        "interrupts",    "dma_requests", "timer_pulses", "timer_gates",
        "uart_cts",      "uart_rx",      "spi_select",   "spi_rx",
        "adc",           "adc_triggers", "pwm_faults",   "pwm_current_limits",
        "pwm_dead_time", "pwm_sync",     "can_errors",   "can_rx",
        "usb_rx",        "usb_setup",    "usb_in",       "usb_host_responses",
        "usb_bus",
    };
    const JsonValue* stimuli = json_get(part, "stimuli");
    size_t index;
    if (stimuli == NULL) {
        return false;
    }
    for (index = 0u; index < sizeof(names) / sizeof(names[0]); index++) {
        if (json_get(stimuli, names[index]) != NULL) {
            return true;
        }
    }
    return false;
}

static bool parts_enable_async_events(const StepParts* parts) {
    const JsonValue* enabled = scalar_field(parts, "async_events");
    bool explicitly_enabled = false;
    size_t index;
    if (json_boolean(enabled, &explicitly_enabled) && explicitly_enabled) {
        return true;
    }
    for (index = 0u; index < parts->count; index++) {
        if (part_has_async_stimuli(parts->items[index])) {
            return true;
        }
    }
    return false;
}

static void reset_pair(Runner* runner) {
    dspic33_reset(&runner->reference, 0u);
    dspic33_reset(&runner->candidate, 0u);
    dspic33_gpio_drive(&runner->reference, 1u, 1u, 1u);
    dspic33_gpio_drive(&runner->candidate, 1u, 1u, 1u);
}

static bool save_pristine_pair(Runner* runner, char* error, size_t error_size) {
    if (!dspic33_copy(&runner->reference_pristine, &runner->reference) ||
        !dspic33_copy(&runner->candidate_pristine, &runner->candidate)) {
        snprintf(error, error_size, "cannot save pristine simulator images");
        return false;
    }
    return true;
}

static bool restore_pristine_pair(Runner* runner, char* error, size_t error_size) {
    if (!dspic33_copy(&runner->reference, &runner->reference_pristine) ||
        !dspic33_copy(&runner->candidate, &runner->candidate_pristine)) {
        snprintf(error, error_size, "cannot restore pristine simulator images");
        return false;
    }
    return true;
}

static bool save_baseline(Runner* runner, char* error, size_t error_size) {
    if (!dspic33_copy(&runner->reference_baseline, &runner->reference) ||
        !dspic33_copy(&runner->candidate_baseline, &runner->candidate)) {
        snprintf(error, error_size, "cannot save simulator baseline");
        return false;
    }
    return true;
}

static bool restore_baseline(Runner* runner, char* error, size_t error_size) {
    if (!dspic33_copy(&runner->reference, &runner->reference_baseline) ||
        !dspic33_copy(&runner->candidate, &runner->candidate_baseline)) {
        snprintf(error, error_size, "cannot restore simulator baseline");
        return false;
    }
    return true;
}

