tylertms/dspic33e-sim/src/firmware_runner.c
static void print_cpu_diagnostics(const Dspic33* cpu) {
    uint64_t start = cpu->interrupt_count > 4u ? cpu->interrupt_count - 4u : 0u;
    uint64_t item;
    uint16_t stack_start = cpu->w[15] > 32u ? (uint16_t)(cpu->w[15] - 32u) : 0u;
    for (item = start; item < cpu->interrupt_count; item++) {
        size_t index = (size_t)(item % 16u);
        printf("  interrupt #%-6" PRIu64 " irq=%u interrupted=0x%06" PRIx32
               " return=0x%06" PRIx32 "\n",
               item + 1u, cpu->interrupt_log_irq[index],
               cpu->interrupt_log_entry[index], cpu->interrupt_log_return[index]);
    }
    printf("  state PC=0x%06" PRIx32 " W0=0x%04x W1=0x%04x W2=0x%04x "
           "W3=0x%04x W4=0x%04x W5=0x%04x W6=0x%04x W7=0x%04x "
           "W8=0x%04x W9=0x%04x W10=0x%04x W11=0x%04x W12=0x%04x "
           "W13=0x%04x W14=0x%04x W15=0x%04x SR=0x%04x TBLPAG=0x%04x DSRPAG=0x%04x "
           "DSWPAG=0x%04x\n",
           cpu->pc, cpu->w[0], cpu->w[1], cpu->w[2], cpu->w[3], cpu->w[4], cpu->w[5],
           cpu->w[6], cpu->w[7], cpu->w[8], cpu->w[9], cpu->w[10], cpu->w[11],
           cpu->w[12], cpu->w[13], cpu->w[14], cpu->w[15], cpu->sr, cpu->tblpag,
           cpu->dsrpag, cpu->dswpag);
    printf("  control call-depth=%u interrupt-depth=%u instructions=%" PRIu64
           " cycles=%" PRIu64 " traps=%" PRIu64 " last-trap=%u "
           "trap-return=0x%06" PRIx32 "\n",
           cpu->call_depth, cpu->interrupt_depth, cpu->instructions, cpu->cycles,
           cpu->trap_count, cpu->last_trap, cpu->last_trap_return);
    printf("  stack 0x%04x:", stack_start);
    for (item = 0u; item < 32u; item += 2u) {
        uint16_t address = (uint16_t)(stack_start + item);
        uint16_t value =
            (uint16_t)(cpu->data[address] | ((uint16_t)cpu->data[address + 1u] << 8u));
        printf(" %04x", value);
    }
    printf("\n");
}

static uint32_t stopped_opcode(const Dspic33* cpu) {
    if (cpu->unsupported_opcode != 0u) {
        return cpu->unsupported_opcode;
    }
    return dspic33_program_range_implemented(cpu->pc, 2u)
               ? dspic33_read_program_word(cpu, cpu->pc)
               : 0u;
}

static bool run_image(Runner* runner, Dspic33* cpu, bool candidate,
                      const JsonValue* call, const JsonValue* stop, char* error,
                      size_t error_size, bool* execution_failure) {
    uint32_t address;
    Dspic33StopReason reason;
    *execution_failure = false;
    if (call != NULL) {
        if (!mapped_address(runner, call, candidate, &address, error, error_size)) {
            return false;
        }
        cpu->pc = address;
        cpu->call_depth = 0u;
    }
    if (stop != NULL) {
        if (!mapped_address(runner, stop, candidate, &address, error, error_size)) {
            return false;
        }
        reason = dspic33_run_until(cpu, address, runner->instruction_limit);
        if (reason != DSPIC33_STOPPED) {
            *execution_failure = true;
            snprintf(error, error_size,
                     "%s stopped with %s at 0x%06" PRIx32 " opcode=0x%06" PRIx32
                     " irq=%u irq-return=0x%06" PRIx32 " interrupts=%" PRIu64
                     " resets=%" PRIu64 " reset-irq=%u trap=%u "
                     "trap-return=0x%06" PRIx32 " traps=%" PRIu64,
                     candidate ? "candidate" : "reference",
                     dspic33_stop_reason_name(reason), cpu->pc, stopped_opcode(cpu),
                     cpu->last_interrupt, cpu->last_interrupt_return,
                     cpu->interrupt_count, cpu->software_reset_count,
                     cpu->reset_interrupt, cpu->last_trap, cpu->last_trap_return,
                     cpu->trap_count);
            return false;
        }
    } else {
        reason = dspic33_run(cpu, runner->instruction_limit);
        if (reason != DSPIC33_RETURNED) {
            *execution_failure = true;
            snprintf(error, error_size,
                     "%s stopped with %s at 0x%06" PRIx32 " opcode=0x%06" PRIx32
                     " irq=%u irq-return=0x%06" PRIx32 " interrupts=%" PRIu64
                     " resets=%" PRIu64 " reset-irq=%u trap=%u "
                     "trap-return=0x%06" PRIx32 " traps=%" PRIu64,
                     candidate ? "candidate" : "reference",
                     dspic33_stop_reason_name(reason), cpu->pc, stopped_opcode(cpu),
                     cpu->last_interrupt, cpu->last_interrupt_return,
                     cpu->interrupt_count, cpu->software_reset_count,
                     cpu->reset_interrupt, cpu->last_trap, cpu->last_trap_return,
                     cpu->trap_count);
            return false;
        }
    }
    return true;
}

struct RunTask {
    Runner* runner;
    Dspic33* cpu;
    const JsonValue* call;
    const JsonValue* stop;
    bool candidate;
    bool succeeded;
    bool execution_failure;
    uint64_t instructions;
    uint64_t cycles;
    char error[256];
#ifdef _WIN32
    bool terminate;
    HANDLE thread;
    HANDLE start_event;
    HANDLE done_event;
#endif
};

static void run_task(RunTask* task) {
    uint64_t instructions = task->cpu->instructions;
    uint64_t cycles = task->cpu->cycles;
    task->succeeded =
        run_image(task->runner, task->cpu, task->candidate, task->call, task->stop,
                  task->error, sizeof(task->error), &task->execution_failure);
    task->instructions = task->cpu->instructions - instructions;
    task->cycles = task->cpu->cycles - cycles;
}

#ifdef _WIN32
static DWORD WINAPI run_task_thread(LPVOID context) {
    RunTask* task = context;
    for (;;) {
        WaitForSingleObject(task->start_event, INFINITE);
        if (task->terminate) {
            return 0u;
        }
        run_task(task);
        SetEvent(task->done_event);
    }
}

static void stop_run_tasks(Runner* runner) {
    size_t index;
    if (runner->run_tasks == NULL) {
        return;
    }
    for (index = 0u; index < 2u; index++) {
        RunTask* task = &runner->run_tasks[index];
        if (task->thread != NULL) {
            task->terminate = true;
            SetEvent(task->start_event);
        }
    }
    for (index = 0u; index < 2u; index++) {
        RunTask* task = &runner->run_tasks[index];
        if (task->thread != NULL) {
            WaitForSingleObject(task->thread, INFINITE);
            CloseHandle(task->thread);
        }
        if (task->start_event != NULL) {
            CloseHandle(task->start_event);
        }
        if (task->done_event != NULL) {
            CloseHandle(task->done_event);
        }
    }
    free(runner->run_tasks);
    runner->run_tasks = NULL;
}

