tylertms/dspic33e-sim/src/firmware_runner.c
static bool start_run_tasks(Runner* runner) {
    size_t index;
    runner->run_tasks = calloc(2u, sizeof(*runner->run_tasks));
    if (runner->run_tasks == NULL) {
        return false;
    }
    for (index = 0u; index < 2u; index++) {
        RunTask* task = &runner->run_tasks[index];
        task->runner = runner;
        task->cpu = index == 0u ? &runner->reference : &runner->candidate;
        task->candidate = index != 0u;
        task->start_event = CreateEventA(NULL, FALSE, FALSE, NULL);
        task->done_event = CreateEventA(NULL, FALSE, FALSE, NULL);
        if (task->start_event == NULL || task->done_event == NULL) {
            stop_run_tasks(runner);
            return false;
        }
        task->thread = CreateThread(NULL, 0u, run_task_thread, task, 0u, NULL);
        if (task->thread == NULL) {
            stop_run_tasks(runner);
            return false;
        }
    }
    return true;
}
#else
static void stop_run_tasks(Runner* runner) { (void)runner; }

static bool start_run_tasks(Runner* runner) {
    (void)runner;
    return true;
}
#endif

static bool run_pair(Runner* runner, const JsonValue* call, const JsonValue* stop,
                     bool async_events_enabled, char* error, size_t error_size,
                     bool* execution_failure) {
#ifdef _WIN32
    RunTask* reference = &runner->run_tasks[0];
    RunTask* candidate = &runner->run_tasks[1];
    HANDLE done_events[2] = {reference->done_event, candidate->done_event};
    reference->call = call;
    reference->stop = stop;
    reference->succeeded = false;
    reference->error[0] = '\0';
    candidate->call = call;
    candidate->stop = stop;
    candidate->succeeded = false;
    candidate->error[0] = '\0';
    dspic33_set_async_events(&runner->reference, async_events_enabled);
    dspic33_set_async_events(&runner->candidate, async_events_enabled);
    SetEvent(reference->start_event);
    SetEvent(candidate->start_event);
    WaitForMultipleObjects(2u, done_events, TRUE, INFINITE);
#else
    RunTask reference_task = {
        .runner = runner, .cpu = &runner->reference, .call = call, .stop = stop};
    RunTask candidate_task = {.runner = runner,
                              .cpu = &runner->candidate,
                              .call = call,
                              .stop = stop,
                              .candidate = true};
    RunTask* reference = &reference_task;
    RunTask* candidate = &candidate_task;
    dspic33_set_async_events(&runner->reference, async_events_enabled);
    dspic33_set_async_events(&runner->candidate, async_events_enabled);
    run_task(reference);
    run_task(candidate);
#endif
    dspic33_set_async_events(&runner->reference, true);
    dspic33_set_async_events(&runner->candidate, true);
    runner->reference_instructions += reference->instructions;
    runner->candidate_instructions += candidate->instructions;
    runner->reference_cycles += reference->cycles;
    runner->candidate_cycles += candidate->cycles;
    *execution_failure = false;
    if (!reference->succeeded) {
        *execution_failure = reference->execution_failure;
        snprintf(error, error_size, "%s", reference->error);
        print_cpu_diagnostics(&runner->reference);
        return false;
    }
    if (!candidate->succeeded) {
        *execution_failure = candidate->execution_failure;
        snprintf(error, error_size, "%s", candidate->error);
        print_cpu_diagnostics(&runner->candidate);
        return false;
    }
    return true;
}

static bool compare_registers(Runner* runner, const StepParts* parts, size_t* failures,
                              char* error, size_t error_size) {
    const JsonValue* values = scalar_field(parts, "registers");
    size_t index;
    if (values == NULL) {
        return true;
    }
    if (values->type != JSON_ARRAY) {
        snprintf(error, error_size, "register observations must be an array");
        return false;
    }
    for (index = 0u; index < values->as.array.count; index++) {
        const JsonValue* item = values->as.array.items[index];
        const char* name = item->type == JSON_STRING
                               ? json_string(item)
                               : json_string(json_get(item, "name"));
        uint8_t reg;
        int64_t mask = UINT16_MAX;
        int64_t expected;
        int64_t expected_location_offset = 0;
        uint32_t reference_expected_address = 0u;
        uint32_t candidate_expected_address = 0u;
        const JsonValue* expected_location =
            item->type == JSON_OBJECT ? json_get(item, "expected_location") : NULL;
        bool has_expected = item->type == JSON_OBJECT &&
                            parse_number(json_get(item, "expected"), &expected);
        bool matched;
        if (!register_index(name, &reg)) {
            snprintf(error, error_size, "invalid register observation");
            return false;
        }
        if (item->type == JSON_OBJECT && json_get(item, "mask") != NULL &&
            !parse_number(json_get(item, "mask"), &mask)) {
            return false;
        }
        if (expected_location != NULL) {
            if (!mapped_address(runner, expected_location, false,
                                &reference_expected_address, error, error_size) ||
                !mapped_address(runner, expected_location, true,
                                &candidate_expected_address, error, error_size) ||
                (json_get(item, "expected_location_offset") != NULL &&
                 !parse_number(json_get(item, "expected_location_offset"),
                               &expected_location_offset))) {
                return false;
            }
            reference_expected_address =
                (uint32_t)(reference_expected_address + expected_location_offset);
            candidate_expected_address =
                (uint32_t)(candidate_expected_address + expected_location_offset);
            matched = (runner->reference.w[reg] & mask) ==
                          ((uint16_t)reference_expected_address & mask) &&
                      (runner->candidate.w[reg] & mask) ==
                          ((uint16_t)candidate_expected_address & mask);
        } else {
            matched =
                (runner->reference.w[reg] & mask) == (runner->candidate.w[reg] & mask);
        }
        if (has_expected && expected_location == NULL) {
            matched = matched &&
                      (runner->reference.w[reg] & mask) == ((uint16_t)expected & mask);
        }
        record_comparison(runner, "register", name,
                          expected_location != NULL ? "mapped-absolute"
                          : has_expected            ? "literal-exact"
                          : mask != UINT16_MAX      ? "masked-defined"
                                                    : "raw-differential",
                          matched);
        if (!matched) {
            (*failures)++;
            if (!runner->summary_only) {
                printf("  register %s: reference=0x%04x candidate=0x%04x", name,
                       runner->reference.w[reg], runner->candidate.w[reg]);
                if (has_expected) {
                    printf(" expected=0x%04x", (uint16_t)expected);
                } else if (expected_location != NULL) {
                    printf(" expected=reference:0x%04x,candidate:0x%04x",
                           (uint16_t)reference_expected_address,
                           (uint16_t)candidate_expected_address);
                }
                printf("\n");
            }
        }
    }
    return true;
}

static bool mapped_fields_overlap(const MappedFields* fields, size_t offset,
                                  size_t size) {
    size_t index;
    for (index = 0u; index < fields->count; index++) {
        const MappedField* field = &fields->items[index];
        if (offset < field->offset + field->size && field->offset < offset + size) {
            return true;
        }
    }
    return false;
}

static bool load_mapped_fields(Runner* runner, const JsonValue* item,
                               size_t observation_size, MappedFields* result,
                               char* error, size_t error_size) {
    const JsonValue* values = entry_field(runner, item, "mapped_fields");
    size_t index;
    result->count = 0u;
    if (values == NULL) {
        return true;
    }
    if (values->type != JSON_ARRAY || values->as.array.count > MAX_MAPPED_FIELDS) {
        snprintf(error, error_size, "invalid mapped memory fields");
        return false;
    }
    for (index = 0u; index < values->as.array.count; index++) {
        const JsonValue* specification = values->as.array.items[index];
        const JsonValue* expected_location =
            json_get(specification, "expected_location");
        const JsonValue* relative_location =
            json_get(specification, "relative_location");
        const JsonValue* expected_locations =
            json_get(specification, "expected_locations");
        const JsonValue* mapped_location =
            expected_location != NULL ? expected_location : relative_location;
        int64_t offset;
        int64_t size;
        int64_t expected_offset = 0;
        int64_t mask = UINT32_MAX;
        bool nullable = false;
        const JsonValue* nullable_value = json_get(specification, "nullable");
        MappedField* field = &result->items[result->count];
        if (specification->type != JSON_OBJECT ||
            !parse_number(json_get(specification, "offset"), &offset) || offset < 0 ||
            !parse_number(json_get(specification, "size"), &size) || size < 1 ||
            size > 4 || (uint64_t)offset + (uint64_t)size > observation_size ||
            (size_t)(expected_location != NULL) + (size_t)(relative_location != NULL) +
                    (size_t)(expected_locations != NULL) !=
                1u ||
            (mapped_location != NULL &&
             (!mapped_address(runner, mapped_location, false,
                              &field->reference_expected, error, error_size) ||
              !mapped_address(runner, mapped_location, true, &field->candidate_expected,
                              error, error_size))) ||
            (expected_locations != NULL &&
             (expected_locations->type != JSON_ARRAY ||
              expected_locations->as.array.count == 0u ||
              expected_locations->as.array.count > MAX_MAPPED_TARGETS)) ||
            (relative_location != NULL &&
             json_get(specification, "expected_location_offset") != NULL) ||
            (expected_locations != NULL &&
             json_get(specification, "expected_location_offset") != NULL) ||
            (nullable_value != NULL && !json_boolean(nullable_value, &nullable)) ||
            (json_get(specification, "expected_location_offset") != NULL &&
             !parse_number(json_get(specification, "expected_location_offset"),
                           &expected_offset)) ||
            (json_get(specification, "mask") != NULL &&
             !parse_number(json_get(specification, "mask"), &mask)) ||
            mapped_fields_overlap(result, (size_t)offset, (size_t)size)) {
            snprintf(error, error_size, "invalid mapped memory field");
            return false;
        }
        field->offset = (size_t)offset;
        field->size = (size_t)size;
        field->reference_expected =
            (uint32_t)(field->reference_expected + expected_offset);
        field->candidate_expected =
            (uint32_t)(field->candidate_expected + expected_offset);
        field->mask = (uint32_t)mask;
        field->relative = relative_location != NULL;
        field->nullable = nullable;
        field->target_count = 0u;
        if (expected_locations != NULL) {
            size_t target_index;
            field->target_count = expected_locations->as.array.count;
            for (target_index = 0u; target_index < field->target_count;
                 target_index++) {
                const JsonValue* target =
                    expected_locations->as.array.items[target_index];
                if (!mapped_address(runner, target, false,
                                    &field->reference_targets[target_index], error,
                                    error_size) ||
                    !mapped_address(runner, target, true,
                                    &field->candidate_targets[target_index], error,
                                    error_size)) {
                    snprintf(error, error_size, "invalid mapped memory field target");
                    return false;
                }
            }
        }
        result->count++;
    }
    return true;
}

static const MappedField* mapped_field_at(const MappedFields* fields, size_t offset) {
    size_t index;
    for (index = 0u; index < fields->count; index++) {
        const MappedField* field = &fields->items[index];
        if (offset >= field->offset && offset < field->offset + field->size) {
            return field;
        }
    }
    return NULL;
}

static const char* memory_evidence_class(const char* required,
                                         const MappedFields* fields, int64_t mask,
                                         bool has_expected, const char* expected_text,
                                         const JsonValue* expected_location) {
    const MappedField* field;
    if (required != NULL) {
        return required;
    }
    if (expected_location != NULL) {
        return "mapped-absolute";
    }
    if (has_expected || expected_text != NULL) {
        return "literal-exact";
    }
    if (fields->count == 0u) {
        return mask != -1 ? "masked-defined" : "raw-differential";
    }
    field = &fields->items[0];
    if (field->target_count != 0u) {
        return "mapped-alternative";
    }
    if (field->relative) {
        return "mapped-relative";
    }
    if (field->nullable) {
        return "nullable";
    }
    return "mapped-absolute";
}

