tylertms/dspic33e-sim/src/firmware_runner.c
static uint32_t read_memory_value(Dspic33* cpu, const char* space, uint32_t address,
                                  size_t size) {
    uint32_t value = 0u;
    size_t index;
    for (index = 0u; index < size; index++) {
        value |= (uint32_t)read_memory_byte(cpu, space, address + (uint32_t)index)
                 << (index * 8u);
    }
    return value;
}

static bool compare_memory_item(Runner* runner, const JsonValue* item,
                                const char* required_category,
                                const char* required_evidence_class, size_t* failures,
                                char* error, size_t error_size) {
    uint32_t reference_address;
    uint32_t candidate_address;
    int64_t size_value;
    int64_t mask = -1;
    int64_t expected;
    bool has_expected = parse_number(entry_field(runner, item, "expected"), &expected);
    const char* expected_text = json_string(entry_field(runner, item, "expected"));
    const char* space = json_string(entry_field(runner, item, "space"));
    const JsonValue* expected_location = entry_field(runner, item, "expected_location");
    uint32_t reference_expected_address = 0u;
    uint32_t candidate_expected_address = 0u;
    int64_t expected_location_offset = 0;
    const char* name = json_string(entry_field(runner, item, "name"));
    size_t size;
    size_t index;
    size_t first_difference;
    MappedFields mapped_fields;
    const MappedField* failed_mapped_field = NULL;
    bool matched = true;
    if (!mapped_address(runner, item, false, &reference_address, error, error_size) ||
        !mapped_address(runner, item, true, &candidate_address, error, error_size) ||
        !field_number(runner, item, "size", 0, &size_value) || size_value < 1) {
        snprintf(error, error_size, "invalid memory observation");
        return false;
    }
    size = (size_t)size_value;
    first_difference = size;
    if (!load_mapped_fields(runner, item, size, &mapped_fields, error, error_size)) {
        return false;
    }
    if (entry_field(runner, item, "mask") != NULL &&
        !parse_number(entry_field(runner, item, "mask"), &mask)) {
        return false;
    }
    for (index = 0u; index < size; index++) {
        if (mapped_field_at(&mapped_fields, index) != NULL) {
            continue;
        }
        if (read_memory_byte(&runner->reference, space,
                             reference_address + (uint32_t)index) !=
            read_memory_byte(&runner->candidate, space,
                             candidate_address + (uint32_t)index)) {
            matched = false;
            first_difference = index;
            break;
        }
    }
    for (index = 0u; index < mapped_fields.count; index++) {
        const MappedField* field = &mapped_fields.items[index];
        uint32_t reference_value =
            read_memory_value(&runner->reference, space,
                              reference_address + (uint32_t)field->offset, field->size);
        uint32_t candidate_value =
            read_memory_value(&runner->candidate, space,
                              candidate_address + (uint32_t)field->offset, field->size);
        bool both_null = reference_value == 0u && candidate_value == 0u;
        bool both_nonnull = reference_value != 0u && candidate_value != 0u;
        bool field_matches = field->nullable && both_null;
        if (!field_matches && (!field->nullable || both_nonnull)) {
            if (field->target_count != 0u) {
                size_t target_index;
                for (target_index = 0u; target_index < field->target_count;
                     target_index++) {
                    if ((reference_value & field->mask) ==
                            (field->reference_targets[target_index] & field->mask) &&
                        (candidate_value & field->mask) ==
                            (field->candidate_targets[target_index] & field->mask)) {
                        field_matches = true;
                        break;
                    }
                }
            } else {
                field_matches =
                    field->relative
                        ? ((reference_value - field->reference_expected) &
                           field->mask) ==
                              ((candidate_value - field->candidate_expected) &
                               field->mask)
                        : (reference_value & field->mask) ==
                                  (field->reference_expected & field->mask) &&
                              (candidate_value & field->mask) ==
                                  (field->candidate_expected & field->mask);
            }
        }
        if (!field_matches) {
            matched = false;
            if (failed_mapped_field == NULL) {
                failed_mapped_field = field;
                if (field->offset < first_difference) {
                    first_difference = field->offset;
                }
            }
        }
    }
    if (!has_expected && expected_text != NULL) {
        uint8_t* expected_bytes = malloc(size);
        if (expected_bytes == NULL) {
            snprintf(error, error_size, "cannot allocate expected memory value");
            return false;
        }
        if (!parse_hex_bytes(expected_text, expected_bytes, size)) {
            free(expected_bytes);
            snprintf(error, error_size, "invalid expected memory value");
            return false;
        }
        for (index = 0u; index < size; index++) {
            bool reference_matches =
                read_memory_byte(&runner->reference, space,
                                 reference_address + (uint32_t)index) ==
                expected_bytes[index];
            bool candidate_matches =
                read_memory_byte(&runner->candidate, space,
                                 candidate_address + (uint32_t)index) ==
                expected_bytes[index];
            if ((!reference_matches || !candidate_matches) &&
                first_difference == size) {
                first_difference = index;
            }
            matched = matched && reference_matches && candidate_matches;
        }
        free(expected_bytes);
    }
    if (expected_location != NULL && size <= 4u) {
        uint32_t reference_value = 0u;
        uint32_t candidate_value = 0u;
        if (!mapped_address(runner, expected_location, false,
                            &reference_expected_address, error, error_size) ||
            !mapped_address(runner, expected_location, true,
                            &candidate_expected_address, error, error_size) ||
            (entry_field(runner, item, "expected_location_offset") != NULL &&
             !parse_number(entry_field(runner, item, "expected_location_offset"),
                           &expected_location_offset))) {
            return false;
        }
        reference_expected_address =
            (uint32_t)(reference_expected_address + expected_location_offset);
        candidate_expected_address =
            (uint32_t)(candidate_expected_address + expected_location_offset);
        for (index = 0u; index < size; index++) {
            reference_value |=
                (uint32_t)read_memory_byte(&runner->reference, space,
                                           reference_address + (uint32_t)index)
                << (index * 8u);
            candidate_value |=
                (uint32_t)read_memory_byte(&runner->candidate, space,
                                           candidate_address + (uint32_t)index)
                << (index * 8u);
        }
        matched = (reference_value & (uint32_t)mask) ==
                      (reference_expected_address & (uint32_t)mask) &&
                  (candidate_value & (uint32_t)mask) ==
                      (candidate_expected_address & (uint32_t)mask);
    } else if (has_expected && size <= 4u) {
        uint32_t reference_value = 0u;
        uint32_t candidate_value = 0u;
        for (index = 0u; index < size; index++) {
            reference_value |=
                (uint32_t)read_memory_byte(&runner->reference, space,
                                           reference_address + (uint32_t)index)
                << (index * 8u);
            candidate_value |=
                (uint32_t)read_memory_byte(&runner->candidate, space,
                                           candidate_address + (uint32_t)index)
                << (index * 8u);
        }
        matched =
            matched &&
            (reference_value & (uint32_t)mask) ==
                ((uint32_t)expected & (uint32_t)mask) &&
            (candidate_value & (uint32_t)mask) == ((uint32_t)expected & (uint32_t)mask);
    }
    record_comparison(runner, required_category == NULL ? "state" : required_category,
                      name == NULL ? "state" : name,
                      memory_evidence_class(required_evidence_class, &mapped_fields,
                                            mask, has_expected, expected_text,
                                            expected_location),
                      matched);
    if (!matched) {
        size_t shown = size > 16u ? 16u : size;
        size_t start = first_difference > 4u ? first_difference - 4u : 0u;
        if (start + shown > size) {
            start = size - shown;
        }
        (*failures)++;
        if (!runner->summary_only) {
            printf("  memory %s", name == NULL ? "state" : name);
            if (first_difference != size) {
                printf(" difference=+0x%zx", first_difference);
            }
            printf(": reference@0x%05" PRIx32 "=", reference_address + (uint32_t)start);
            for (index = 0u; index < shown; index++) {
                printf("%02x",
                       read_memory_byte(&runner->reference, space,
                                        reference_address + (uint32_t)(start + index)));
            }
            printf(" candidate@0x%05" PRIx32 "=", candidate_address + (uint32_t)start);
            for (index = 0u; index < shown; index++) {
                printf("%02x",
                       read_memory_byte(&runner->candidate, space,
                                        candidate_address + (uint32_t)(start + index)));
            }
            if (start + shown != size) {
                printf("...");
            }
            if (has_expected) {
                printf(" expected=0x%0*" PRIx64, (int)(size * 2u), (uint64_t)expected);
            } else if (expected_text != NULL) {
                printf(" expected=%s", expected_text);
            } else if (expected_location != NULL) {
                printf(" expected=reference:0x%08" PRIx32 ",candidate:0x%08" PRIx32,
                       reference_expected_address, candidate_expected_address);
            } else if (failed_mapped_field != NULL) {
                if (failed_mapped_field->target_count != 0u) {
                    printf(" expected-field=mapped-address");
                } else {
                    printf(" expected-field=reference:0x%08" PRIx32
                           ",candidate:0x%08" PRIx32,
                           failed_mapped_field->reference_expected,
                           failed_mapped_field->candidate_expected);
                }
            }
            printf("\n");
        }
    }
    return true;
}

