tylertms/dspic33e-sim/src/firmware_runner.c
static bool compare_memory(Runner* runner, const StepParts* parts, size_t* failures,
                           char* error, size_t error_size) {
    size_t part_index;
    bool found = false;
    for (part_index = parts->count; part_index != 0u;) {
        const JsonValue* values = json_get(parts->items[--part_index], "memory");
        size_t index;
        if (values == NULL) {
            continue;
        }
        if (found && part_index < 2u) {
            continue;
        }
        found = true;
        if (values->type != JSON_ARRAY) {
            return false;
        }
        for (index = 0u; index < values->as.array.count; index++) {
            if (!compare_memory_item(runner, values->as.array.items[index], NULL, NULL,
                                     failures, error, error_size)) {
                return false;
            }
        }
    }
    {
        bool exact = false;
        const JsonValue* enabled = scalar_field(parts, "compare_exact_program_data");
        const JsonValue* values = suite_section(runner, "exact_program_data");
        json_boolean(enabled, &exact);
        if (exact && values != NULL && values->type == JSON_ARRAY) {
            size_t index;
            for (index = 0u; index < values->as.array.count; index++) {
                if (!compare_memory_item(runner, values->as.array.items[index],
                                         "exact-program-data", "exact-program-data",
                                         failures, error, error_size)) {
                    return false;
                }
            }
        }
    }
    return true;
}

static bool compare_pins(Runner* runner, const StepParts* parts, size_t* failures,
                         char* error, size_t error_size) {
    const JsonValue* values = scalar_field(parts, "pins");
    size_t index;
    if (values == NULL) {
        return true;
    }
    if (values->type != JSON_ARRAY) {
        return false;
    }
    for (index = 0u; index < values->as.array.count; index++) {
        const JsonValue* item = values->as.array.items[index];
        const char* name = item->type == JSON_STRING
                               ? json_string(item)
                               : json_string(json_get(item, "name"));
        const char* expected =
            item->type == JSON_OBJECT ? json_string(json_get(item, "expected")) : NULL;
        uint8_t port;
        uint8_t bit;
        bool reference_high;
        bool candidate_high;
        bool reference_driven;
        bool candidate_driven;
        bool matched;
        if (!pin_index(name, &port, &bit)) {
            snprintf(error, error_size, "invalid pin observation");
            return false;
        }
        if (!dspic33_gpio_pin(&runner->reference, port, bit, &reference_high) ||
            !dspic33_gpio_pin(&runner->candidate, port, bit, &candidate_high)) {
            snprintf(error, error_size, "invalid pin observation");
            return false;
        }
        reference_driven = (runner->reference.io.gpio_driven[port] & (1u << bit)) != 0u;
        candidate_driven = (runner->candidate.io.gpio_driven[port] & (1u << bit)) != 0u;
        if (reference_driven) {
            reference_high =
                (runner->reference.io.gpio[port] & (uint16_t)(1u << bit)) != 0u;
        }
        if (candidate_driven) {
            candidate_high =
                (runner->candidate.io.gpio[port] & (uint16_t)(1u << bit)) != 0u;
        }
        matched = reference_high == candidate_high;
        if (expected != NULL) {
            PinLevel level = pin_level(expected);
            if (level == PIN_LEVEL_INVALID) {
                snprintf(error, error_size, "invalid expected pin level");
                return false;
            }
            if (level == PIN_LEVEL_FLOATING) {
                matched = matched && !reference_driven && !candidate_driven;
            } else {
                matched = matched && reference_high == (level == PIN_LEVEL_HIGH);
            }
        }
        record_comparison(runner, "pin", name,
                          expected == NULL ? "raw-differential" : "literal-exact",
                          matched);
        if (!matched) {
            (*failures)++;
            if (!runner->summary_only) {
                printf("  pin %s: reference=%s candidate=%s", name,
                       reference_high ? "3.3V" : "0V", candidate_high ? "3.3V" : "0V");
                if (expected != NULL) {
                    printf(" expected=%s", expected);
                }
                printf("\n");
            }
        }
    }
    return true;
}

static bool can_frames_match(const Dspic33CanFrame* reference,
                             const Dspic33CanFrame* candidate) {
    return reference->identifier == candidate->identifier &&
           reference->extended == candidate->extended &&
           reference->remote == candidate->remote &&
           reference->length == candidate->length &&
           memcmp(reference->data, candidate->data, reference->length) == 0;
}

static bool uart_frames_match(const Dspic33UartFrame* reference,
                              const Dspic33UartFrame* candidate) {
    return reference->value == candidate->value &&
           reference->baud_period == candidate->baud_period &&
           reference->data_bits == candidate->data_bits &&
           reference->stop_bits == candidate->stop_bits &&
           reference->parity == candidate->parity &&
           reference->parity_error == candidate->parity_error &&
           reference->framing_error == candidate->framing_error &&
           reference->break_signal == candidate->break_signal &&
           reference->inverted == candidate->inverted &&
           reference->irda == candidate->irda;
}

static void print_uart_frame(bool present, const Dspic33UartFrame* frame) {
    if (!present) {
        printf("none");
        return;
    }
    printf("value=0x%03x baud=%u data=%u stop=%u parity=%u parity-error=%u "
           "framing-error=%u break=%u inverted=%u irda=%u",
           frame->value, frame->baud_period, frame->data_bits, frame->stop_bits,
           frame->parity, frame->parity_error ? 1u : 0u, frame->framing_error ? 1u : 0u,
           frame->break_signal ? 1u : 0u, frame->inverted ? 1u : 0u,
           frame->irda ? 1u : 0u);
}

static bool compare_uart_transmit(Runner* runner, const StepParts* parts,
                                  size_t* failures, char* error, size_t error_size) {
    const JsonValue* values = scalar_field(parts, "uart_tx");
    size_t index;
    if (values == NULL) {
        return true;
    }
    if (values->type != JSON_ARRAY) {
        snprintf(error, error_size, "UART transmit observations must be an array");
        return false;
    }
    for (index = 0u; index < values->as.array.count; index++) {
        const JsonValue* item = values->as.array.items[index];
        uint64_t channel;
        char comparison_name[64];
        size_t reference_count;
        size_t candidate_count;
        size_t frame_index = 0u;
        if (item->type != JSON_OBJECT ||
            !event_number(item, "channel", DSPIC33_UART_COUNT - 1u, 0u, true,
                          &channel)) {
            snprintf(error, error_size, "invalid UART transmit observation");
            return false;
        }
        reference_count = runner->reference.io.uart_tx[channel].count;
        candidate_count = runner->candidate.io.uart_tx[channel].count;
        snprintf(comparison_name, sizeof(comparison_name),
                 "UART%" PRIu64 " transmit count", channel + 1u);
        record_comparison(runner, "uart_tx", comparison_name, "raw-differential",
                          reference_count == candidate_count);
        if (reference_count != candidate_count) {
            (*failures)++;
            if (!runner->summary_only) {
                printf("  UART%" PRIu64
                       " transmit count: reference=%zu candidate=%zu\n",
                       channel + 1u, reference_count, candidate_count);
            }
        }
        while (runner->reference.io.uart_tx[channel].count != 0u ||
               runner->candidate.io.uart_tx[channel].count != 0u) {
            Dspic33UartFrame reference_frame;
            Dspic33UartFrame candidate_frame;
            bool reference_present = dspic33_uart_transmit(
                &runner->reference, (uint8_t)channel, &reference_frame);
            bool candidate_present = dspic33_uart_transmit(
                &runner->candidate, (uint8_t)channel, &candidate_frame);
            bool matched = reference_present == candidate_present;
            if (reference_present && candidate_present) {
                matched = uart_frames_match(&reference_frame, &candidate_frame);
            }
            snprintf(comparison_name, sizeof(comparison_name),
                     "UART%" PRIu64 " transmit frame %zu", channel + 1u, frame_index);
            record_comparison(runner, "uart_tx", comparison_name, "raw-differential",
                              matched);
            if (!matched) {
                (*failures)++;
                if (!runner->summary_only) {
                    printf("  UART%" PRIu64 " transmit frame %zu: reference=",
                           channel + 1u, frame_index);
                    print_uart_frame(reference_present, &reference_frame);
                    printf(" candidate=");
                    print_uart_frame(candidate_present, &candidate_frame);
                    printf("\n");
                }
            }
            frame_index++;
        }
    }
    return true;
}

