tylertms/dspic33e-sim/src/firmware_runner.c
static bool compare_spi_transmit(Runner* runner, const StepParts* parts,
                                 size_t* failures, char* error, size_t error_size) {
    const JsonValue* values = scalar_field(parts, "spi_tx");
    size_t index;
    if (values == NULL) {
        return true;
    }
    if (values->type != JSON_ARRAY) {
        snprintf(error, error_size, "SPI transmit observations must be an array");
        return false;
    }
    for (index = 0u; index < values->as.array.count; index++) {
        const JsonValue* item = values->as.array.items[index];
        const JsonValue* expected_values;
        const char* evidence_class;
        uint64_t channel;
        char comparison_name[64];
        size_t reference_count;
        size_t candidate_count;
        size_t expected_count = 0u;
        size_t byte_index = 0u;
        if (item->type != JSON_OBJECT ||
            !event_number(item, "channel", DSPIC33_SPI_COUNT - 1u, 0u, true,
                          &channel)) {
            snprintf(error, error_size, "invalid SPI transmit observation");
            return false;
        }
        expected_values = json_get(item, "bytes");
        evidence_class = expected_values != NULL ? "literal-exact" : "raw-differential";
        if (expected_values != NULL) {
            if (expected_values->type != JSON_ARRAY ||
                expected_values->as.array.count >
                    sizeof(runner->reference.io.spi_tx[channel].bytes)) {
                snprintf(error, error_size, "invalid SPI transmit byte expectation");
                return false;
            }
            expected_count = expected_values->as.array.count;
            for (byte_index = 0u; byte_index < expected_count; byte_index++) {
                int64_t expected_value;
                if (!parse_number(expected_values->as.array.items[byte_index],
                                  &expected_value) ||
                    expected_value < 0 || expected_value > UINT8_MAX) {
                    snprintf(error, error_size,
                             "invalid SPI transmit byte expectation");
                    return false;
                }
            }
            byte_index = 0u;
        }
        reference_count = runner->reference.io.spi_tx[channel].count;
        candidate_count = runner->candidate.io.spi_tx[channel].count;
        snprintf(comparison_name, sizeof(comparison_name),
                 "SPI%" PRIu64 " transmit count", channel + 1u);
        record_comparison(
            runner, "spi_tx", comparison_name, evidence_class,
            reference_count == candidate_count &&
                (expected_values == NULL || reference_count == expected_count));
        if (reference_count != candidate_count ||
            (expected_values != NULL && reference_count != expected_count)) {
            (*failures)++;
            if (!runner->summary_only) {
                printf("  SPI%" PRIu64 " transmit count: reference=%zu candidate=%zu",
                       channel + 1u, reference_count, candidate_count);
                if (expected_values != NULL) {
                    printf(" expected=%zu", expected_count);
                }
                printf("\n");
            }
        }
        while (runner->reference.io.spi_tx[channel].count != 0u ||
               runner->candidate.io.spi_tx[channel].count != 0u ||
               (expected_values != NULL && byte_index < expected_count)) {
            uint8_t reference_value = 0u;
            uint8_t candidate_value = 0u;
            int64_t expected_value = 0;
            bool reference_present = dspic33_spi_transmit(
                &runner->reference, (uint8_t)channel, &reference_value);
            bool candidate_present = dspic33_spi_transmit(
                &runner->candidate, (uint8_t)channel, &candidate_value);
            bool matched = reference_present == candidate_present &&
                           (!reference_present || reference_value == candidate_value);
            if (expected_values != NULL) {
                bool expected_present = byte_index < expected_count;
                if (expected_present) {
                    parse_number(expected_values->as.array.items[byte_index],
                                 &expected_value);
                }
                matched = matched && expected_present && reference_present &&
                          reference_value == (uint8_t)expected_value;
            }
            snprintf(comparison_name, sizeof(comparison_name),
                     "SPI%" PRIu64 " transmit byte %zu", channel + 1u, byte_index);
            record_comparison(runner, "spi_tx", comparison_name, evidence_class,
                              matched);
            if (!matched) {
                (*failures)++;
                if (!runner->summary_only) {
                    printf("  SPI%" PRIu64
                           " transmit byte %zu: reference=%s0x%02x candidate=%s0x%02x",
                           channel + 1u, byte_index, reference_present ? "" : "none/",
                           reference_value, candidate_present ? "" : "none/",
                           candidate_value);
                    if (expected_values != NULL) {
                        printf(" expected=%s0x%02x",
                               byte_index < expected_count ? "" : "none/",
                               (uint8_t)expected_value);
                    }
                    printf("\n");
                }
            }
            byte_index++;
        }
    }
    return true;
}

static void print_can_frame(bool present, const Dspic33CanFrame* frame) {
    uint8_t index;
    if (!present) {
        printf("none");
        return;
    }
    printf("id=0x%08" PRIx32 " extended=%u remote=%u data=", frame->identifier,
           frame->extended ? 1u : 0u, frame->remote ? 1u : 0u);
    for (index = 0u; index < frame->length; index++) {
        printf("%02x", frame->data[index]);
    }
}

static bool compare_can_transmit(Runner* runner, const StepParts* parts,
                                 size_t* failures, char* error, size_t error_size) {
    const JsonValue* values = scalar_field(parts, "can_tx");
    size_t index;
    if (values == NULL) {
        return true;
    }
    if (values->type != JSON_ARRAY) {
        snprintf(error, error_size, "CAN transmit observations must be an array");
        return false;
    }
    for (index = 0u; index < values->as.array.count; index++) {
        const JsonValue* item = values->as.array.items[index];
        uint64_t channel;
        char comparison_name[64];
        size_t reference_count;
        size_t candidate_count;
        size_t frame_index = 0u;
        if (item->type != JSON_OBJECT ||
            !event_number(item, "channel", DSPIC33_CAN_COUNT - 1u, 0u, true,
                          &channel)) {
            snprintf(error, error_size, "invalid CAN transmit observation");
            return false;
        }
        reference_count = runner->reference.io.can_tx[channel].count;
        candidate_count = runner->candidate.io.can_tx[channel].count;
        snprintf(comparison_name, sizeof(comparison_name),
                 "CAN%" PRIu64 " transmit count", channel + 1u);
        record_comparison(runner, "can_tx", comparison_name, "raw-differential",
                          reference_count == candidate_count);
        if (reference_count != candidate_count) {
            (*failures)++;
            if (!runner->summary_only) {
                printf("  CAN%" PRIu64 " transmit count: reference=%zu candidate=%zu\n",
                       channel + 1u, reference_count, candidate_count);
            }
        }
        while (runner->reference.io.can_tx[channel].count != 0u ||
               runner->candidate.io.can_tx[channel].count != 0u) {
            Dspic33CanFrame reference_frame;
            Dspic33CanFrame candidate_frame;
            bool reference_present = dspic33_can_transmit(
                &runner->reference, (uint8_t)channel, &reference_frame);
            bool candidate_present = dspic33_can_transmit(
                &runner->candidate, (uint8_t)channel, &candidate_frame);
            bool matched = reference_present == candidate_present;
            if (reference_present && candidate_present) {
                matched = can_frames_match(&reference_frame, &candidate_frame);
            }
            snprintf(comparison_name, sizeof(comparison_name),
                     "CAN%" PRIu64 " transmit frame %zu", channel + 1u, frame_index);
            record_comparison(runner, "can_tx", comparison_name, "raw-differential",
                              matched);
            if (!matched) {
                (*failures)++;
                if (!runner->summary_only) {
                    printf("  CAN%" PRIu64 " transmit frame %zu: reference=",
                           channel + 1u, frame_index);
                    print_can_frame(reference_present, &reference_frame);
                    printf(" candidate=");
                    print_can_frame(candidate_present, &candidate_frame);
                    printf("\n");
                }
            }
            frame_index++;
        }
    }
    return true;
}

static bool usb_packets_match(const Dspic33UsbPacket* reference,
                              const Dspic33UsbPacket* candidate) {
    return reference->address == candidate->address &&
           reference->endpoint == candidate->endpoint &&
           reference->pid == candidate->pid && reference->error == candidate->error &&
           reference->handshake == candidate->handshake &&
           reference->data1 == candidate->data1 &&
           reference->low_speed == candidate->low_speed &&
           reference->size == candidate->size &&
           memcmp(reference->data, candidate->data, reference->size) == 0;
}

static void print_usb_packet(bool present, const Dspic33UsbPacket* packet) {
    uint16_t index;
    if (!present) {
        printf("none");
        return;
    }
    printf("address=%u endpoint=%u pid=0x%x handshake=%u data1=%u low-speed=%u "
           "error=0x%02x size=%u data=",
           packet->address, packet->endpoint, packet->pid, packet->handshake,
           packet->data1 ? 1u : 0u, packet->low_speed ? 1u : 0u, packet->error,
           packet->size);
    for (index = 0u; index < packet->size; index++) {
        printf("%02x", packet->data[index]);
    }
}

static bool load_usb_packet_expectation(const JsonValue* specification,
                                        Dspic33UsbPacket* packet) {
    const JsonValue* data = json_get(specification, "data");
    const JsonValue* data1 = json_get(specification, "data1");
    const JsonValue* low_speed = json_get(specification, "low_speed");
    uint64_t value;
    size_t index;
    memset(packet, 0, sizeof(*packet));
    if (specification->type != JSON_OBJECT || data == NULL ||
        data->type != JSON_ARRAY || data->as.array.count > sizeof(packet->data) ||
        !event_number(specification, "address", 0x7fu, 0u, true, &value)) {
        return false;
    }
    packet->address = (uint8_t)value;
    if (!event_number(specification, "endpoint", 0x0fu, 0u, true, &value)) {
        return false;
    }
    packet->endpoint = (uint8_t)value;
    if (!event_number(specification, "pid", 0x0fu, 0u, true, &value)) {
        return false;
    }
    packet->pid = (uint8_t)value;
    if (!event_number(specification, "handshake", DSPIC33_USB_HANDSHAKE_ERROR, 0u, true,
                      &value)) {
        return false;
    }
    packet->handshake = (Dspic33UsbHandshake)value;
    if (!event_number(specification, "error", UINT8_MAX, 0u, true, &value) ||
        data1 == NULL || !json_boolean(data1, &packet->data1) || low_speed == NULL ||
        !json_boolean(low_speed, &packet->low_speed)) {
        return false;
    }
    packet->error = (uint8_t)value;
    packet->size = (uint16_t)data->as.array.count;
    for (index = 0u; index < data->as.array.count; index++) {
        int64_t byte;
        if (!parse_number(data->as.array.items[index], &byte) || byte < 0 ||
            byte > UINT8_MAX) {
            return false;
        }
        packet->data[index] = (uint8_t)byte;
    }
    return true;
}

static bool compare_usb_transmit(Runner* runner, const StepParts* parts,
                                 size_t* failures, char* error, size_t error_size) {
    const JsonValue* values = scalar_field(parts, "usb_tx");
    size_t index;
    if (values == NULL) {
        return true;
    }
    if (values->type != JSON_ARRAY) {
        snprintf(error, error_size, "USB transmit observations must be an array");
        return false;
    }
    for (index = 0u; index < values->as.array.count; index++) {
        const JsonValue* item = values->as.array.items[index];
        const JsonValue* expected_values;
        const char* evidence_class;
        size_t reference_count;
        size_t candidate_count;
        size_t expected_count = 0u;
        size_t packet_index = 0u;
        char comparison_name[64];
        if (item->type != JSON_OBJECT) {
            snprintf(error, error_size, "invalid USB transmit observation");
            return false;
        }
        expected_values = json_get(item, "packets");
        evidence_class = expected_values != NULL ? "literal-exact" : "raw-differential";
        if (expected_values != NULL) {
            if (expected_values->type != JSON_ARRAY ||
                expected_values->as.array.count > DSPIC33_USB_PACKET_QUEUE_SIZE) {
                snprintf(error, error_size, "invalid USB transmit packet expectation");
                return false;
            }
            expected_count = expected_values->as.array.count;
            for (packet_index = 0u; packet_index < expected_count; packet_index++) {
                Dspic33UsbPacket expected_packet;
                if (!load_usb_packet_expectation(
                        expected_values->as.array.items[packet_index],
                        &expected_packet)) {
                    snprintf(error, error_size,
                             "invalid USB transmit packet expectation");
                    return false;
                }
            }
            packet_index = 0u;
        }
        reference_count = runner->reference.io.usb_tx.count;
        candidate_count = runner->candidate.io.usb_tx.count;
        record_comparison(
            runner, "usb_tx", "USB transmit count", evidence_class,
            reference_count == candidate_count &&
                (expected_values == NULL || reference_count == expected_count));
        if (reference_count != candidate_count ||
            (expected_values != NULL && reference_count != expected_count)) {
            (*failures)++;
            if (!runner->summary_only) {
                printf("  USB transmit count: reference=%zu candidate=%zu",
                       reference_count, candidate_count);
                if (expected_values != NULL) {
                    printf(" expected=%zu", expected_count);
                }
                printf("\n");
            }
        }
        while (runner->reference.io.usb_tx.count != 0u ||
               runner->candidate.io.usb_tx.count != 0u ||
               (expected_values != NULL && packet_index < expected_count)) {
            Dspic33UsbPacket reference_packet;
            Dspic33UsbPacket candidate_packet;
            Dspic33UsbPacket expected_packet;
            bool expected_present =
                expected_values != NULL && packet_index < expected_count;
            bool reference_present =
                dspic33_usb_transmit(&runner->reference, &reference_packet);
            bool candidate_present =
                dspic33_usb_transmit(&runner->candidate, &candidate_packet);
            bool matched = reference_present == candidate_present;
            if (reference_present && candidate_present) {
                matched = usb_packets_match(&reference_packet, &candidate_packet);
            }
            if (expected_values != NULL) {
                if (expected_present) {
                    load_usb_packet_expectation(
                        expected_values->as.array.items[packet_index],
                        &expected_packet);
                }
                matched = matched && expected_present && reference_present &&
                          usb_packets_match(&reference_packet, &expected_packet);
            }
            snprintf(comparison_name, sizeof(comparison_name),
                     "USB transmit packet %zu", packet_index);
            record_comparison(runner, "usb_tx", comparison_name, evidence_class,
                              matched);
            if (!matched) {
                (*failures)++;
                if (!runner->summary_only) {
                    printf("  USB transmit packet %zu: reference=", packet_index);
                    print_usb_packet(reference_present, &reference_packet);
                    printf(" candidate=");
                    print_usb_packet(candidate_present, &candidate_packet);
                    if (expected_values != NULL) {
                        printf(" expected=");
                        print_usb_packet(expected_present, &expected_packet);
                    }
                    printf("\n");
                }
            }
            packet_index++;
        }
    }
    return true;
}

static bool apply_generated_value(Runner* runner, const JsonValue* specification,
                                  int64_t value, bool range, char* error,
                                  size_t error_size) {
    const char* name = json_string(json_get(specification, "register"));
    const JsonValue* location = json_get(specification, "location");
    int64_t base = 0;
    int64_t shift = 0;
    int64_t offset = 0;
    uint16_t word;
    if (!range) {
        if ((json_get(specification, "base") != NULL &&
             !parse_number(json_get(specification, "base"), &base)) ||
            (json_get(specification, "shift") != NULL &&
             !parse_number(json_get(specification, "shift"), &shift))) {
            return false;
        }
    }
    if (shift < 0 || shift > 15) {
        return false;
    }
    word = (uint16_t)(base | (value << shift));
    if (location != NULL) {
        uint32_t reference_address;
        uint32_t candidate_address;
        if ((json_get(specification, "offset") != NULL &&
             !parse_number(json_get(specification, "offset"), &offset)) ||
            !mapped_address(runner, location, false, &reference_address, error,
                            error_size) ||
            !mapped_address(runner, location, true, &candidate_address, error,
                            error_size)) {
            return false;
        }
        dspic33_write_word(&runner->reference, (uint32_t)(reference_address + offset),
                           word);
        dspic33_write_word(&runner->candidate, (uint32_t)(candidate_address + offset),
                           word);
        return true;
    }
    {
        uint8_t reg;
        if (!register_index(name, &reg)) {
            snprintf(error, error_size, "generated value has no destination");
            return false;
        }
        dspic33_set_working_register(&runner->reference, reg, word);
        dspic33_set_working_register(&runner->candidate, reg, word);
    }
    return true;
}

