tylertms/dspic33e-sim/src/firmware_runner.c
static bool matrix_table_value_type(const char* type, int64_t* minimum,
                                    int64_t* maximum, bool* word) {
    if (type != NULL && strcmp(type, "u8") == 0) {
        *minimum = 0;
        *maximum = UINT8_MAX;
        *word = false;
        return true;
    }
    if (type != NULL && strcmp(type, "i8") == 0) {
        *minimum = INT8_MIN;
        *maximum = INT8_MAX;
        *word = false;
        return true;
    }
    if (type != NULL && strcmp(type, "u16") == 0) {
        *minimum = 0;
        *maximum = UINT16_MAX;
        *word = true;
        return true;
    }
    if (type != NULL && strcmp(type, "i16") == 0) {
        *minimum = INT16_MIN;
        *maximum = INT16_MAX;
        *word = true;
        return true;
    }
    return false;
}

static bool apply_matrix_table_selection(Runner* runner,
                                         const MatrixSelection* selection, char* error,
                                         size_t error_size) {
    const JsonValue* columns = json_get(selection->specification, "columns");
    const JsonValue* values = json_get(selection->explicit_case, "values");
    size_t index;
    if (columns == NULL || columns->type != JSON_ARRAY || values == NULL ||
        values->type != JSON_ARRAY ||
        values->as.array.count > columns->as.array.count) {
        snprintf(error, error_size, "invalid matrix table row");
        return false;
    }
    for (index = 0u; index < values->as.array.count; index++) {
        const JsonValue* value_entry = values->as.array.items[index];
        const JsonValue* column = columns->as.array.items[index];
        const char* type;
        int64_t minimum;
        int64_t maximum;
        int64_t count = 1;
        int64_t value;
        uint32_t reference_address;
        uint32_t candidate_address;
        bool word;
        size_t item;
        if (value_entry->type == JSON_NULL) {
            continue;
        }
        type = json_string(json_get(column, "type"));
        if (column->type != JSON_OBJECT || !parse_number(value_entry, &value) ||
            (json_get(column, "count") != NULL &&
             !parse_number(json_get(column, "count"), &count)) ||
            count < 1 ||
            !mapped_address(runner, column, false, &reference_address, error,
                            error_size) ||
            !mapped_address(runner, column, true, &candidate_address, error,
                            error_size)) {
            snprintf(error, error_size, "invalid matrix table value");
            return false;
        }
        if (type != NULL && strcmp(type, "pointer") == 0) {
            const JsonValue* source = json_get(column, "value_location");
            uint32_t reference_value;
            uint32_t candidate_value;
            if (source == NULL || count != 1 || value < 0 ||
                !mapped_address(runner, source, false, &reference_value, error,
                                error_size) ||
                !mapped_address(runner, source, true, &candidate_value, error,
                                error_size)) {
                snprintf(error, error_size, "invalid matrix table pointer");
                return false;
            }
            dspic33_write_word(&runner->reference, reference_address,
                               (uint16_t)(reference_value + value));
            dspic33_write_word(&runner->candidate, candidate_address,
                               (uint16_t)(candidate_value + value));
            continue;
        }
        if (!matrix_table_value_type(type, &minimum, &maximum, &word) ||
            value < minimum || value > maximum) {
            snprintf(error, error_size, "invalid matrix table value");
            return false;
        }
        for (item = 0u; item < (size_t)count; item++) {
            if (word) {
                dspic33_write_word(&runner->reference,
                                   reference_address + (uint32_t)item * 2u,
                                   (uint16_t)value);
                dspic33_write_word(&runner->candidate,
                                   candidate_address + (uint32_t)item * 2u,
                                   (uint16_t)value);
            } else {
                dspic33_write_byte(&runner->reference,
                                   reference_address + (uint32_t)item, (uint8_t)value);
                dspic33_write_byte(&runner->candidate,
                                   candidate_address + (uint32_t)item, (uint8_t)value);
            }
        }
    }
    return true;
}

static bool execute_step(Runner* runner, const char* scenario_name,
                         const char* generated_name, const StepParts* parts,
                         const JsonValue* scenario_call,
                         const JsonValue* range_specification, int64_t range_value,
                         const MatrixSelection* matrix_selections,
                         size_t matrix_selection_count, char* error,
                         size_t error_size) {
    const JsonValue* reset = scalar_field(parts, "reset_before");
    const JsonValue* call = scalar_field(parts, "call");
    const JsonValue* stop = scalar_field(parts, "stop");
    const char* step_name = generated_name;
    bool reset_value = false;
    bool async_events_enabled;
    size_t index;
    size_t failures = 0u;
    bool execution_failure;
    if (step_name == NULL) {
        step_name = json_string(scalar_field(parts, "name"));
    }
    if (step_name == NULL) {
        step_name = "unnamed step";
    }
    runner->current_step_identifier = json_string(scalar_field(parts, "id"));
    if (runner->current_step_identifier == NULL) {
        runner->current_step_identifier = step_name;
    }
    if (call == NULL) {
        call = scenario_call;
    }
    if (runner->restore_baseline && !restore_baseline(runner, error, error_size)) {
        return false;
    }
    json_boolean(reset, &reset_value);
    if (reset_value) {
        reset_pair(runner);
    }
    runner->current_step++;
    if (!runner->failures_only && !runner->summary_only) {
        printf("[running] %zu/%zu %s: %s\n", runner->current_step, runner->steps,
               scenario_name, step_name);
        fflush(stdout);
    }
    for (index = 0u; index < parts->count; index++) {
        if (!apply_stimuli_part(runner, parts->items[index], error, error_size)) {
            return false;
        }
    }
    if (range_specification != NULL &&
        !apply_generated_value(runner, range_specification, range_value, true, error,
                               error_size)) {
        return false;
    }
    for (index = 0u; index < matrix_selection_count; index++) {
        const MatrixSelection* selection = &matrix_selections[index];
        if (json_get(selection->specification, "columns") != NULL) {
            if (!apply_matrix_table_selection(runner, selection, error, error_size)) {
                return false;
            }
        } else if (selection->generated &&
                   !apply_generated_value(runner, selection->specification,
                                          selection->value, false, error, error_size)) {
            return false;
        }
    }
    async_events_enabled =
        call == NULL || stop != NULL || parts_enable_async_events(parts);
    if (!run_pair(runner, call, stop, async_events_enabled, error, error_size,
                  &execution_failure)) {
        if (!execution_failure) {
            return false;
        }
        record_comparison(runner, "execution", "reference reached stop point",
                          "literal-exact", false);
        record_comparison(runner, "execution", "candidate reached stop point",
                          "literal-exact", false);
        runner->failed++;
        if (!runner->summary_only) {
            printf("[failed] %zu/%zu %s (execution: %s)\n", runner->current_step,
                   runner->steps, step_name, error);
            fflush(stdout);
        }
        return true;
    }
    record_comparison(runner, "execution", "reference reached stop point",
                      "literal-exact", true);
    record_comparison(runner, "execution", "candidate reached stop point",
                      "literal-exact", true);
    if (!compare_registers(runner, parts, &failures, error, error_size) ||
        !compare_memory(runner, parts, &failures, error, error_size) ||
        !compare_pins(runner, parts, &failures, error, error_size) ||
        !compare_uart_transmit(runner, parts, &failures, error, error_size) ||
        !compare_spi_transmit(runner, parts, &failures, error, error_size) ||
        !compare_can_transmit(runner, parts, &failures, error, error_size) ||
        !compare_usb_transmit(runner, parts, &failures, error, error_size)) {
        return false;
    }
    if (failures == 0u) {
        runner->passed++;
        if (!runner->failures_only && !runner->summary_only) {
            printf("[passed] %zu/%zu %s\n", runner->current_step, runner->steps,
                   step_name);
        }
    } else {
        runner->failed++;
        if (!runner->summary_only) {
            printf("[failed] %zu/%zu %s (%zu differences)\n", runner->current_step,
                   runner->steps, step_name, failures);
        }
    }
    fflush(stdout);
    return true;
}

static bool value_at(const Runner* runner, const JsonValue* specification, size_t index,
                     int64_t* result) {
    const char* set_name = json_string(json_get(specification, "values"));
    const JsonValue* values;
    int64_t start;
    int64_t stride = 1;
    if (set_name != NULL) {
        values = named_entry(suite_section(runner, "value_sets"), set_name);
        return values != NULL && values->type == JSON_ARRAY &&
               index < values->as.array.count &&
               parse_number(values->as.array.items[index], result);
    }
    if (!parse_number(json_get(specification, "start"), &start)) {
        return false;
    }
    if (json_get(specification, "stride") != NULL &&
        !parse_number(json_get(specification, "stride"), &stride)) {
        return false;
    }
    *result = start + (int64_t)index * stride;
    return true;
}

static bool execute_fixture(Runner* runner, const char* fixture_name,
                            const char* scenario_name, unsigned depth, char* error,
                            size_t error_size) {
    const JsonValue* fixture;
    const JsonValue* nested;
    const JsonValue* steps;
    const JsonValue* suite_defaults =
        json_get(suite_section(runner, "testbench"), "defaults");
    size_t index;
    if (depth > 32u) {
        snprintf(error, error_size, "fixture recursion is too deep");
        return false;
    }
    fixture = named_entry(suite_section(runner, "fixtures"), fixture_name);
    if (fixture == NULL) {
        snprintf(error, error_size, "unknown fixture: %s", fixture_name);
        return false;
    }
    if (fixture->type == JSON_ARRAY) {
        steps = fixture;
        nested = NULL;
    } else {
        nested = json_get(fixture, "fixtures");
        steps = json_get(fixture, "steps");
    }
    if (nested != NULL && nested->type == JSON_ARRAY) {
        for (index = 0u; index < nested->as.array.count; index++) {
            const char* name = json_string(nested->as.array.items[index]);
            if (name == NULL || !execute_fixture(runner, name, scenario_name,
                                                 depth + 1u, error, error_size)) {
                return false;
            }
        }
    }
    if (steps == NULL || steps->type != JSON_ARRAY) {
        return true;
    }
    for (index = 0u; index < steps->as.array.count; index++) {
        StepParts parts = {0};
        if (!add_part(&parts, suite_defaults, error, error_size) ||
            !add_part(&parts, steps->as.array.items[index], error, error_size) ||
            !execute_step(runner, scenario_name, NULL, &parts, NULL, NULL, 0, NULL, 0u,
                          error, error_size)) {
            return false;
        }
    }
    return true;
}

