tylertms/dspic33e-sim/src/firmware_runner.c
static bool add_common_parts(Runner* runner, const JsonValue* scenario,
                             StepParts* parts, char* error, size_t error_size) {
    return add_part(parts, json_get(suite_section(runner, "testbench"), "defaults"),
                    error, error_size) &&
           add_part(parts, json_get(scenario, "defaults"), error, error_size);
}

static bool execute_regular_steps(Runner* runner, const JsonValue* scenario,
                                  const JsonValue* steps, const char* scenario_name,
                                  char* error, size_t error_size) {
    const JsonValue* scenario_call = json_get(scenario, "call");
    size_t index;
    for (index = 0u; index < steps->as.array.count; index++) {
        StepParts parts = {0};
        if (!step_selected(runner, steps->as.array.items[index])) {
            continue;
        }
        if (!add_common_parts(runner, scenario, &parts, error, error_size) ||
            !add_part(&parts, steps->as.array.items[index], error, error_size) ||
            !execute_step(runner, scenario_name, NULL, &parts, scenario_call, NULL, 0,
                          NULL, 0u, error, error_size)) {
            return false;
        }
    }
    return true;
}

static bool execute_range(Runner* runner, const JsonValue* scenario,
                          const JsonValue* range, const char* scenario_name,
                          char* error, size_t error_size) {
    const JsonValue* scenario_call = json_get(scenario, "call");
    const JsonValue* base = json_get(range, "step");
    const char* reg = json_string(json_get(range, "register"));
    size_t count = values_count(runner, range);
    size_t index;
    for (index = 0u; index < count; index++) {
        StepParts parts = {0};
        int64_t value;
        char name[512];
        if (!value_at(runner, range, index, &value)) {
            return false;
        }
        snprintf(name, sizeof(name), "%s at %s=0x%" PRIx64, scenario_name,
                 reg == NULL ? "value" : reg, (uint64_t)value);
        if (!generated_step_selected(runner, name)) {
            continue;
        }
        if (!add_common_parts(runner, scenario, &parts, error, error_size) ||
            !add_part(&parts, base, error, error_size) ||
            !execute_step(runner, scenario_name, name, &parts, scenario_call, range,
                          value, NULL, 0u, error, error_size)) {
            return false;
        }
    }
    return true;
}

static bool select_matrix_case(const Runner* runner, const JsonValue* dimension,
                               size_t index, MatrixSelection* selection) {
    const JsonValue* rows;
    memset(selection, 0, sizeof(*selection));
    selection->specification = dimension;
    if (dimension->type == JSON_ARRAY) {
        if (index >= dimension->as.array.count) {
            return false;
        }
        selection->explicit_case = dimension->as.array.items[index];
        return true;
    }
    rows = json_get(dimension, "rows");
    if (rows != NULL) {
        if (rows->type != JSON_ARRAY || index >= rows->as.array.count) {
            return false;
        }
        selection->explicit_case = rows->as.array.items[index];
        return true;
    }
    selection->generated = true;
    return value_at(runner, dimension, index, &selection->value);
}

static bool execute_matrix_selection(Runner* runner, const JsonValue* scenario,
                                     const JsonValue* matrix,
                                     const MatrixSelection* selections,
                                     size_t selection_count, const char* scenario_name,
                                     size_t ordinal, char* error, size_t error_size) {
    StepParts parts = {0};
    const JsonValue* scenario_call = json_get(scenario, "call");
    char filter_name[512];
    char name[512];
    size_t index;
    size_t used;
    snprintf(filter_name, sizeof(filter_name), "%s matrix case %zu", scenario_name,
             ordinal + 1u);
    if (!generated_step_selected(runner, filter_name)) {
        return true;
    }
    used = (size_t)snprintf(name, sizeof(name), "%s [", filter_name);
    for (index = 0u; index < selection_count && used < sizeof(name); index++) {
        const char* id =
            selections[index].explicit_case == NULL
                ? json_string(json_get(selections[index].specification, "id"))
                : json_string(json_get(selections[index].explicit_case, "id"));
        int written;
        if (id == NULL) {
            id = "value";
        }
        written = selections[index].generated
                      ? snprintf(name + used, sizeof(name) - used, "%s%s=%" PRId64,
                                 index == 0u ? "" : ",", id, selections[index].value)
                      : snprintf(name + used, sizeof(name) - used, "%s%s",
                                 index == 0u ? "" : ",", id);
        if (written < 0 || (size_t)written >= sizeof(name) - used) {
            used = sizeof(name);
        } else {
            used += (size_t)written;
        }
    }
    if (used < sizeof(name) - 1u) {
        name[used++] = ']';
        name[used] = '\0';
    } else {
        name[sizeof(name) - 1u] = '\0';
    }
    if (!add_common_parts(runner, scenario, &parts, error, error_size) ||
        !add_part(&parts, json_get(matrix, "step"), error, error_size)) {
        return false;
    }
    for (index = 0u; index < selection_count; index++) {
        if (json_get(selections[index].specification, "columns") == NULL &&
            !add_part(&parts, selections[index].explicit_case, error, error_size)) {
            return false;
        }
    }
    return execute_step(runner, scenario_name, name, &parts, scenario_call, NULL, 0,
                        selections, selection_count, error, error_size);
}

static bool execute_product_matrix(Runner* runner, const JsonValue* scenario,
                                   const JsonValue* matrix, const JsonValue* dimensions,
                                   const char* scenario_name, char* error,
                                   size_t error_size) {
    size_t counts[MAX_MATRIX_DIMENSIONS];
    size_t indices[MAX_MATRIX_DIMENSIONS] = {0};
    MatrixSelection selections[MAX_MATRIX_DIMENSIONS];
    size_t ordinal = 0u;
    size_t dimension;
    for (dimension = 0u; dimension < dimensions->as.array.count; dimension++) {
        const JsonValue* value = dimensions->as.array.items[dimension];
        counts[dimension] = matrix_dimension_count(runner, value);
    }
    for (;;) {
        for (dimension = 0u; dimension < dimensions->as.array.count; dimension++) {
            if (!select_matrix_case(runner, dimensions->as.array.items[dimension],
                                    indices[dimension], &selections[dimension])) {
                return false;
            }
        }
        if (!execute_matrix_selection(runner, scenario, matrix, selections,
                                      dimensions->as.array.count, scenario_name,
                                      ordinal++, error, error_size)) {
            return false;
        }
        dimension = dimensions->as.array.count;
        while (dimension != 0u) {
            dimension--;
            if (++indices[dimension] < counts[dimension]) {
                break;
            }
            indices[dimension] = 0u;
        }
        if (dimension == 0u && indices[0] == 0u) {
            return true;
        }
    }
}

