tylertms/dspic33e-sim/src/firmware_runner.c
static bool execute_pairwise_matrix(Runner* runner, const JsonValue* scenario,
                                    const JsonValue* matrix,
                                    const JsonValue* dimensions,
                                    const char* scenario_name, char* error,
                                    size_t error_size) {
    MatrixSelection selections[MAX_MATRIX_DIMENSIONS];
    size_t counts[MAX_MATRIX_DIMENSIONS];
    size_t ordinal = 0u;
    size_t left;
    size_t right;
    size_t index;
    size_t other;
    for (index = 0u; index < dimensions->as.array.count; index++) {
        const JsonValue* dimension = dimensions->as.array.items[index];
        counts[index] = matrix_dimension_count(runner, dimension);
        if (!select_matrix_case(runner, dimension, 0u, &selections[index])) {
            return false;
        }
    }
    if (!execute_matrix_selection(runner, scenario, matrix, selections,
                                  dimensions->as.array.count, scenario_name, ordinal++,
                                  error, error_size)) {
        return false;
    }
    for (index = 0u; index < dimensions->as.array.count; index++) {
        for (other = 1u; other < counts[index]; other++) {
            MatrixSelection changed;
            if (!select_matrix_case(runner, dimensions->as.array.items[index], other,
                                    &changed)) {
                return false;
            }
            selections[index] = changed;
            if (!execute_matrix_selection(runner, scenario, matrix, selections,
                                          dimensions->as.array.count, scenario_name,
                                          ordinal++, error, error_size) ||
                !select_matrix_case(runner, dimensions->as.array.items[index], 0u,
                                    &selections[index])) {
                return false;
            }
        }
    }
    for (left = 0u; left < dimensions->as.array.count; left++) {
        for (right = left + 1u; right < dimensions->as.array.count; right++) {
            size_t left_case;
            size_t right_case;
            for (left_case = 1u; left_case < counts[left]; left_case++) {
                for (right_case = 1u; right_case < counts[right]; right_case++) {
                    if (!select_matrix_case(runner, dimensions->as.array.items[left],
                                            left_case, &selections[left]) ||
                        !select_matrix_case(runner, dimensions->as.array.items[right],
                                            right_case, &selections[right]) ||
                        !execute_matrix_selection(runner, scenario, matrix, selections,
                                                  dimensions->as.array.count,
                                                  scenario_name, ordinal++, error,
                                                  error_size)) {
                        return false;
                    }
                }
            }
            if (!select_matrix_case(runner, dimensions->as.array.items[left], 0u,
                                    &selections[left]) ||
                !select_matrix_case(runner, dimensions->as.array.items[right], 0u,
                                    &selections[right])) {
                return false;
            }
        }
    }
    return true;
}

static bool execute_matrix(Runner* runner, const JsonValue* scenario,
                           const JsonValue* matrix, const char* scenario_name,
                           char* error, size_t error_size) {
    const JsonValue* dimensions = json_get(matrix, "dimensions");
    const char* strategy = json_string(json_get(matrix, "strategy"));
    if (dimensions == NULL || dimensions->type != JSON_ARRAY ||
        dimensions->as.array.count == 0u ||
        dimensions->as.array.count > MAX_MATRIX_DIMENSIONS) {
        return false;
    }
    if (strategy != NULL && strcmp(strategy, "pairwise") == 0) {
        return execute_pairwise_matrix(runner, scenario, matrix, dimensions,
                                       scenario_name, error, error_size);
    }
    return execute_product_matrix(runner, scenario, matrix, dimensions, scenario_name,
                                  error, error_size);
}

static bool execute_scenario(const char* path, const JsonValue* scenario, void* context,
                             char* error, size_t error_size) {
    Runner* runner = context;
    const char* id = json_string(json_get(scenario, "id"));
    const char* name = json_string(json_get(scenario, "name"));
    const JsonValue* fixtures;
    const JsonValue* mode;
    size_t start_step;
    size_t start_passed;
    size_t start_failed;
    size_t start_comparisons;
    size_t index;
    bool completed;
    if (!scenario_selected(runner, scenario)) {
        return true;
    }
    if (scenario_step_count(runner, scenario) == 0u) {
        return true;
    }
    runner->current_scenario++;
    runner->current_scenario_identifier = id;
    runner->current_scenario_source = path;
    start_step = runner->current_step;
    start_passed = runner->passed;
    start_failed = runner->failed;
    start_comparisons = runner->comparisons;
    runner->restore_baseline = false;
    if (!restore_pristine_pair(runner, error, error_size)) {
        return false;
    }
    printf("[scenario] %zu/%zu %s\n", runner->current_scenario, runner->scenarios,
           name);
    fflush(stdout);
    fixtures = json_get(scenario, "fixtures");
    if (fixtures != NULL && fixtures->type == JSON_ARRAY) {
        for (index = 0u; index < fixtures->as.array.count; index++) {
            const char* fixture_name = json_string(fixtures->as.array.items[index]);
            if (fixture_name == NULL ||
                !execute_fixture(runner, fixture_name, name, 0u, error, error_size)) {
                return false;
            }
        }
    }
    mode = json_get(scenario, "steps");
    if (mode != NULL) {
        runner->restore_baseline = false;
        completed =
            execute_regular_steps(runner, scenario, mode, name, error, error_size);
    } else {
        if (!save_baseline(runner, error, error_size)) {
            return false;
        }
        runner->restore_baseline = true;
        mode = json_get(scenario, "vectors");
        if (mode != NULL) {
            completed =
                execute_regular_steps(runner, scenario, mode, name, error, error_size);
        } else {
            mode = json_get(scenario, "range");
            if (mode != NULL) {
                completed =
                    execute_range(runner, scenario, mode, name, error, error_size);
            } else {
                mode = json_get(scenario, "matrix");
                completed = mode != NULL && execute_matrix(runner, scenario, mode, name,
                                                           error, error_size);
            }
        }
    }
    if (completed && runner->summary_only) {
        printf("[scenario-result] %s steps=%zu passed=%zu failed=%zu comparisons=%zu\n",
               id, runner->current_step - start_step, runner->passed - start_passed,
               runner->failed - start_failed, runner->comparisons - start_comparisons);
        fflush(stdout);
    }
    return completed;
}

static void print_usage(const char* program) {
    fprintf(stderr,
            "Usage: %s --suite FILE [--scenario PATTERN] [--step PATTERN] "
            "[--shard-index INDEX --shard-count COUNT] [--failures-only] "
            "[--summary-only] [--plan] [--max-instructions COUNT] "
            "[--reference FILE] [--candidate FILE] [--ledger FILE] "
            "[--summary-json FILE]\n",
            program);
}

static int run_firmware_runner(int argc, char** argv, Runner* runner) {
    const char* suite_path = NULL;
    char error[256];
    int index;
    runner->shard_count = 1u;
    runner->program_path = argv[0];
    runner->instruction_limit = DEFAULT_INSTRUCTION_LIMIT;
    for (index = 1; index < argc; index++) {
        if (strcmp(argv[index], "--suite") == 0 && index + 1 < argc) {
            suite_path = argv[++index];
        } else if (strcmp(argv[index], "--scenario") == 0 && index + 1 < argc) {
            runner->scenario_filter = argv[++index];
        } else if (strcmp(argv[index], "--step") == 0 && index + 1 < argc) {
            runner->step_filter = argv[++index];
        } else if (strcmp(argv[index], "--shard-index") == 0 && index + 1 < argc) {
            char* end;
            runner->shard_index = strtoull(argv[++index], &end, 0);
            if (*end != '\0') {
                print_usage(argv[0]);
                return 2;
            }
        } else if (strcmp(argv[index], "--shard-count") == 0 && index + 1 < argc) {
            char* end;
            runner->shard_count = strtoull(argv[++index], &end, 0);
            if (*end != '\0' || runner->shard_count == 0u) {
                print_usage(argv[0]);
                return 2;
            }
        } else if (strcmp(argv[index], "--plan") == 0) {
            runner->plan_only = true;
        } else if (strcmp(argv[index], "--summary-only") == 0) {
            runner->summary_only = true;
        } else if (strcmp(argv[index], "--failures-only") == 0) {
            runner->failures_only = true;
        } else if (strcmp(argv[index], "--max-instructions") == 0 && index + 1 < argc) {
            char* end;
            runner->instruction_limit = strtoull(argv[++index], &end, 0);
            if (*end != '\0' || runner->instruction_limit == 0u) {
                print_usage(argv[0]);
                return 2;
            }
        } else if (strcmp(argv[index], "--reference") == 0 && index + 1 < argc) {
            runner->reference_path = argv[++index];
        } else if (strcmp(argv[index], "--candidate") == 0 && index + 1 < argc) {
            runner->candidate_path = argv[++index];
        } else if (strcmp(argv[index], "--ledger") == 0 && index + 1 < argc) {
            runner->ledger_path = argv[++index];
        } else if (strcmp(argv[index], "--summary-json") == 0 && index + 1 < argc) {
            runner->summary_path = argv[++index];
        } else {
            print_usage(argv[0]);
            return 2;
        }
    }
    if (suite_path == NULL || runner->shard_index >= runner->shard_count ||
        (runner->ledger_path != NULL && runner->summary_path != NULL &&
         strcmp(runner->ledger_path, runner->summary_path) == 0) ||
        !suite_directory(suite_path, runner->suite_directory,
                         sizeof(runner->suite_directory))) {
        print_usage(argv[0]);
        return 2;
    }
    runner->suite_path = suite_path;
    printf("[prepare] Loading firmware test specification\n");
    fflush(stdout);
    runner->suite = json_read(suite_path, error, sizeof(error));
    if (runner->suite == NULL) {
        fprintf(stderr, "[error] %s\n", error);
        return 1;
    }
    printf("[prepare] Counting streamed scenarios\n");
    fflush(stdout);
    if (!stream_patterns(runner, count_scenario, error, sizeof(error)) ||
        runner->scenarios == 0u) {
        if (runner->scenarios == 0u) {
            snprintf(error, sizeof(error),
                     "no scenarios matched the requested filters");
        }
        fprintf(stderr, "[error] %s\n", error);
        json_free((JsonValue*)runner->suite);
        return 1;
    }
    printf("[prepare] Loaded %zu scenarios with %zu test steps\n", runner->scenarios,
           runner->steps);
    printf("[limits] max-instructions=%" PRIu64 "\n", runner->instruction_limit);
    fflush(stdout);
    if (runner->plan_only) {
        json_free((JsonValue*)runner->suite);
        return 0;
    }
    if (!open_images(runner, error, sizeof(error))) {
        fprintf(stderr, "[error] %s\n", error);
        close_images(runner);
        json_free((JsonValue*)runner->suite);
        return 1;
    }
    if (!open_comparison_ledger(runner, error, sizeof(error))) {
        fprintf(stderr, "[error] %s\n", error);
        close_images(runner);
        json_free((JsonValue*)runner->suite);
        return 1;
    }
    if (!start_run_tasks(runner)) {
        fprintf(stderr, "[error] cannot start native simulator workers\n");
        close_comparison_ledger(runner, false, error, sizeof(error));
        close_images(runner);
        json_free((JsonValue*)runner->suite);
        return 1;
    }
    printf("[ready] Starting native differential execution\n");
    fflush(stdout);
    if (!stream_patterns(runner, execute_scenario, error, sizeof(error))) {
        fprintf(stderr, "[error] %s\n", error);
        stop_run_tasks(runner);
        close_comparison_ledger(runner, false, error, sizeof(error));
        close_images(runner);
        json_free((JsonValue*)runner->suite);
        return 1;
    }
    if (!close_comparison_ledger(runner, true, error, sizeof(error))) {
        fprintf(stderr, "[error] %s\n", error);
        stop_run_tasks(runner);
        close_images(runner);
        json_free((JsonValue*)runner->suite);
        return 1;
    }
    if (!write_summary_json(runner, error, sizeof(error))) {
        fprintf(stderr, "[error] %s\n", error);
        stop_run_tasks(runner);
        close_images(runner);
        json_free((JsonValue*)runner->suite);
        return 1;
    }
    printf("[summary] scenarios=%zu steps=%zu passed=%zu failed=%zu comparisons=%zu "
           "failed-comparisons=%zu\n",
           runner->current_scenario, runner->current_step, runner->passed,
           runner->failed, runner->comparisons, runner->failed_comparisons);
    printf("[work] reference-instructions=%" PRIu64 " candidate-instructions=%" PRIu64
           " reference-cycles=%" PRIu64 " candidate-cycles=%" PRIu64 "\n",
           runner->reference_instructions, runner->candidate_instructions,
           runner->reference_cycles, runner->candidate_cycles);
    stop_run_tasks(runner);
    close_images(runner);
    json_free((JsonValue*)runner->suite);
    return runner->failed == 0u ? 0 : 1;
}

int firmware_runner_main(int argc, char** argv) {
    Runner* runner = calloc(1u, sizeof(*runner));
    int result;
    if (runner == NULL) {
        fprintf(stderr, "[error] cannot allocate firmware runner state\n");
        return 1;
    }
    result = run_firmware_runner(argc, argv, runner);
    free(runner);
    return result;
}
